[
  {
    "groupName": "Dublin Buddhist Centre",
    "eventTime": "2024-04-12T07:30:00+01:00",
    "eventDetails": "These events are suitable for those who already have a regular meditation practice and want to continue to do so in a supportive environment with other meditators. There is no requirement to book in advance, just turn up, or log in. For online sits, please click the link below a few minutes before each sit. Join the morning meditations each day using Zoom (password if required is dropinmed ). On a donation basis. No need to book, just drop in if you know how to meditate.",
    "lat": 53.351986,
    "lon": -6.253541,
    "locationInfo": "James Joyce Street, Dublin, D",
    "eventName": "Drop In Morning Meditation (In person and Online)",
    "eventEndTime": "2024-04-12T08:25:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/d/5/5/600_515492085.webp?w=750"
  },
  {
    "groupName": "City Life Drawing",
    "eventTime": "2024-04-12T18:30:00+01:00",
    "eventDetails": "## LIFE DRAWING An untaught life drawing class in the flesh with a live model at 27 Pearse Street Dublin 2 (The Ireland Institute) for Friday evening\n6.30-9-00PM\nRoom will be open from about 6.20PM\n€26 (Buy Four Classes for 84-save €20)\nWe draw from about 6.45-9-00PM with a break half way through.\nBOOK HERE: http://dublinlifedrawing.com/classes Or use this link https://pay.sumup.com/b2c/QEJ2JW9J\n(please include your email address) If you've prepaid for some classes send a quick email to dublindrawing@gmail.com Materials:\nWe have drawing boards and clips and some charcoal and paper. If you have your own materials bring them- they will be better quality. Places are limited so book as soon as you can.\nTLDR:\nFriday Evening\nLIFE DRAWING UNTAUGHT 6.30-9.00PM\nRoom open from about 6.20PM\n27 Pearse Street Dublin 2 (The Ireland Institute)\nBOOK HERE: http://dublinlifedrawing.com/classes",
    "lat": 53.345108,
    "lon": -6.25345,
    "locationInfo": "27 Pearse Street, Dublin, D",
    "eventName": "Friday Life Drawing - Pearse Street",
    "eventEndTime": "2024-04-12T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/7/5/b/600_508270075.webp?w=750"
  },
  {
    "groupName": "Muslim Meetups Ireland",
    "eventTime": "2024-04-12T19:00:00+01:00",
    "eventDetails": "Weekly Friday meetup, meet new people and other muslims in Dublin. A clean, and relaxed environment, nice end to a busy week. follow us on instagram!",
    "lat": 53.339878,
    "lon": -6.264484,
    "locationInfo": "11 Bow Lane East, St Stephen's Green, Dublin, D",
    "eventName": "Weekly Friday Meetup",
    "eventEndTime": "2024-04-12T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/6/c/0/600_519174976.webp?w=750"
  },
  {
    "groupName": "Iskcon Dublin Krishna Temple",
    "eventTime": "2024-04-12T18:00:00+01:00",
    "eventDetails": "Come join us every Friday evening for 1 hour of Bhagavad Gita Discussions starting at 18:00 until 19:00. we try to read 5 verses from the Bhagavad Gita along with its translation and the purport by His Divine Grace A. C. Bhaktivedanta Swami Prabhupada who is the founder of the ISKCON (International Society for Krishna Consciousness ) also known as the Hare Krishna. You are welcome to join us along with your family and friends where you can also participate in this event. After the 1 hour of Bhagavad Gita Discussion, we then switch to 2 hours of Mantra Meditation between 19:00 to 21:00 where different people lead the Mantra Meditation (Kirtan) during these 2 hours. This event usually ends with ecstatic singing of the Kirtan where people stand up and dance. and when we speak of Hare Krishna, we also speak of free food, the event ends with the distribution of some snacks and or sweets on most Fridays.",
    "lat": 53.348412,
    "lon": -6.26088,
    "locationInfo": "83 Middle Abbey Street, Dublin 1",
    "eventName": "Bhagavad Gita As It Is Discussions & Mantra Meditation (Kirtan)",
    "eventEndTime": "2024-04-12T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/b/4/3/600_516343843.webp?w=750"
  },
  {
    "groupName": "Dublin Free Walking Tours",
    "eventTime": "2024-04-12T13:00:00+01:00",
    "eventDetails": "FREE TICKETS AT THE LINK BELOW\nTickets! Discover a different side to Dublin. Ever wonder... what's down there? Well my friend today is the day we explore the alternative side to Dublin. Come check out a chocolate factory, fruit market, hidden bar, time house, art gallery and many more unique places. This will be a two hour tour and end in Temple Bar. This tour is great way to get social and meet new people - lots of people come alone so don't be shy! We are meeting outside the Ambassador Theatre at 1pm on Friday.",
    "lat": 53.352913,
    "lon": -6.262148,
    "locationInfo": "Upper O’Connell Street, Dublin 1, D",
    "eventName": "Alternative Side of Dublin FREE Walking Tour",
    "eventEndTime": "2024-04-12T15:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/d/a/2/600_514496738.webp?w=750"
  },
  {
    "groupName": "Social Events",
    "eventTime": "2024-04-12T18:15:00+01:00",
    "eventDetails": "Join me to enjoy music from the enchanting world of Opera arias, in collaboration with Wexford Festival Opera. Book your free tickets online here and read about the event. Please ensure that you have a valid ticket from Eventbrite before arriving at the venue. PROGRAMME We can go for a drink afterwards in a nearby bar. All suggestions are welcomed. Right of admission reserved by the venue. Feel free to leave a message if you have any questions. Don't forget to book your ticket here to secure your spot otherwise you won't be able to attend. IMPORTANT DISCLAIMER - PLEASE NOTICE\nFree tickets reservation will not guarantee entry to the Hall. Once the capacity of the venue is reached, no more patrons will be allowed to enter. Please sign up, spread the word, and hope to see you there.",
    "lat": 53.34234,
    "lon": -6.250134,
    "locationInfo": "36 Westland Row, Dublin 2",
    "eventName": "RECITAL DI ARIE D'OPERA - WITH WEXFORD FESTIVAL OPERA",
    "eventEndTime": "2024-04-12T20:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/6/0/9/600_513054793.webp?w=750"
  },
  {
    "groupName": "self empowering woman who suffered abuse",
    "eventTime": "2024-04-12T18:00:00+01:00",
    "eventDetails": "Sister Circle, Woman Coming Together to share there Stories and Heal from Narcissist Abuse. We will be doing Meditations on the Chakras, tapping into the Energy Body, Releasing old Emotions, Mindful Movement, Yoga, This will be a Gentle Evening of Self Care to Develop some Tools to assist you on the Path of Self awareness, recognising old patterns and believes that no longer serve and breaking cycles of not being good enough. A journey of Self Empowerment.",
    "lat": 53.349804,
    "lon": -6.26031,
    "locationInfo": "Blanchardstown (next to shopping centre), Dublin",
    "eventName": "Empowering Woman Sister Circle, Healing from Narcissist Abuse. ",
    "eventEndTime": "2024-04-12T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/8/d/600_513335469.webp?w=750"
  },
  {
    "groupName": "Argentinian Tango Social and Dancing",
    "eventTime": "2024-04-12T19:00:00+01:00",
    "eventDetails": "We offers Argentinian Tango classes for beginers and intermediate/ adv students every Friday from 7 pm to 8 pm and after it we are gonna run the Social which called is Milonga. Everyone can join us in whatever time that you wish. Everybody is welcome and level and ages as well. Please we recommend using comfortable clothes and dancing shoes in case that you have it. Hopefully we are looking forward to seeing soon Diana & Raul",
    "lat": 53.346786,
    "lon": -6.265031,
    "locationInfo": "24 Strand Street Great, Dublin",
    "eventName": "Tango Classes and Social ",
    "eventEndTime": "2024-04-12T23:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/2/b/3/600_518524787.webp?w=750"
  },
  {
    "groupName": "Things To Do In Dublin  -  Events, Tours, Walks",
    "eventTime": "2024-04-12T18:30:00+01:00",
    "eventDetails": "Join us on an adventure across Dublin city hearing the myths and the terrifying legends that stalk our streets. Tickets can be bought at the link below!\nTICKETS!! Visit haunted buildings, hear harrowing tales of horror and creepy legends.\nDiscover some stories from the past and a different side to Dublin\nWe have a long tradition of storytelling in Ireland and our oldest stories are of the banshees, the ghosts and the things that keep you up at night. These stories were traditionally told around a fire but we will be heading to the spaces where these things happened, hearing the stories and seeing for ourselves. Embrace the supernatural and come on a ghostly adventure with us.\nSome of what we cover:\n-Maud Gonne's shocking ghostly secrets\n-The unexplained terrors that have been seen in the Shelbourne hotel\n-The grisly hangings near St Stephens Green\n-The gruesome tales of the Tenements\n-The 'Resurrection Men'\n-Charlie Parker and the haunting of the Olympia Theatre\n-The Zombie experimenter of Anglesea Street\n-Darkey Kelly and her basement of Bodies\n-The Dolocher, The Demon pig of Dublin\n& So much more!",
    "lat": 53.33929,
    "lon": -6.251352,
    "locationInfo": "82 Merrion Square South, Dublin, D",
    "eventName": "Legends, Ghosts and Ghouls of Dublin (PAID) | Walking Tour",
    "eventEndTime": "2024-04-12T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/f/d/8/600_517009112.webp?w=750"
  },
  {
    "groupName": "Dublin Retreats & Spiritual Growth",
    "eventTime": "2024-04-12T18:00:00+02:00",
    "eventDetails": "All volunteer workers welcome, if you are a good organiser, looking for ways to spend your free time, enjoy meeting & arranging outings with other team organisers, this church group could use your help Tea & coffee ☕️ Links:\nhttps://youtube.com/watch?v=zX4qVm_biAE&feature=share",
    "lat": 53.346695,
    "lon": -6.250986,
    "locationInfo": "City Quay, Dublin 2, D",
    "eventName": "Christian Prayer group, volunteer workers",
    "eventEndTime": "2024-04-12T19:30:00+02:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Learn to paint",
    "eventTime": "2024-04-12T18:30:00+01:00",
    "eventDetails": "I invite you to participate in a space where you can learn different painting techniques and express yourself through art.\n-Fridays from 6.30 pm to 7.30pm.\nThe prices are: 20 Euro per class or 70 Euro for 4 classes.\nadress: \"My Art\"Dublín 2.\n11 William St S, Dublin 2, D02 N727 Please confirm your assistance. I have room for 8 people per class. Please bring acrylics of primary colours and a canvas, preferably 30x 40 cm. follow me on Instagram: Inspir.arte.2023\nhttps://instagram.com/inspir.arte2023?igshid=NzZlODBkYWE4Ng==",
    "lat": 53.34255,
    "lon": -6.262471,
    "locationInfo": "The Basement, 15 Pembroke Street Lwr, Dublin 2",
    "eventName": "Learn to paint ",
    "eventEndTime": "2024-04-12T20:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/6/b/600_516002155.webp?w=750"
  },
  {
    "groupName": "Narcissist Abuse Recovery Support Group",
    "eventTime": "2024-04-12T18:00:00+01:00",
    "eventDetails": "Sister Circle, Woman Coming Together to share there Stories and Heal from Narcissist Abuse. We will be doing Meditations on the Chakras, tapping into the Energy Body, Releasing old Emotions, Mindful Movement, Yoga, This will be a Gentle Evening of Self Care to Develop some Tools to assist you on the Path of Self awareness, recognising old patterns and believes that no longer serve and breaking cycles of not being good enough and codependency. A journey of Self Empowerment.",
    "lat": 53.349804,
    "lon": -6.26031,
    "locationInfo": "Blanchardstown (next to shopping centre), Dublin",
    "eventName": "Narcissist Abuse Support Group",
    "eventEndTime": "2024-04-12T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/0/e/600_519711726.webp?w=750"
  },
  {
    "groupName": "Greystones Beading and Jewelry Design Meetup Group",
    "eventTime": "2024-04-12T11:00:00+01:00",
    "eventDetails": "Learn how to create one of a kind piece of jewellery to take home. You will learn the basics of jewellery making and get a chance to work with leather and beads .\nMeet likeminded people and relax in a comfortable space with natural light . Refreshments. Small group for individual attention and demonstrations.\nAdult class . All materials included . €25 per class or book 6 classes for €140 .\nText Mary for more information . I have been teaching for many years , and have vast experience and love to share my knowledge with others .",
    "lat": 53.106709,
    "lon": -6.041349,
    "locationInfo": "Sea Road, Kilcoole",
    "eventName": "Greystones Creative Jewellery Making Class for Beginners. ",
    "eventEndTime": "2024-04-12T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/b/9/4/600_519463924.webp?w=750"
  },
  {
    "groupName": "Dublin Local History Meetup",
    "eventTime": "2024-04-12T10:45:00+01:00",
    "eventDetails": "Cost: 5 euros. RSVP Opens on Friday 5th April at 09:00\nCome and join us for a tour to learn about this iconic Dublin landmark building.\nThe present building was designed by James Gandon and work commenced in 1781. it took ten years to complete and cost £200,000. The tour of the Visitors Centre tell us about the history of the building and the work it undertook. It was burnt down in the Civil War; we will also hear some interesting stories associated with it. Afterwards we will go to Abbey Street to coffee and a chat. There will also be the option of something to eat. We'll meet at 10:45 by the Reception of the Museum, the tour starts PROMPTLY at 11:00. Unfortunately, we can't wait for late comers. Details: 1. RSVP to event by pressing ATTEND.\n2. Then Pay the 5 euros using the link below.\n3.Remember to select 'Friends' and to write your name and state the\nevent that you are paying for\n4. https://paypal.me/HistoryChris?country.x=IE&locale.x=en_US\n5. It will take 24 hours for the unpaid marked by your name to change to Paid\n3 Afterwards we will go for coffee/lunch and chat.\n4. We look forward to seeing you there.",
    "lat": 53.348705,
    "lon": -6.253139,
    "locationInfo": ", Dublin 1, Co",
    "eventName": "Tour of the Custom House Visitor Centre",
    "eventEndTime": "2024-04-12T12:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/9/f/b/600_519995323.webp?w=750"
  },
  {
    "groupName": "Dublin Free Tours",
    "eventTime": "2024-04-12T11:00:00+01:00",
    "eventDetails": "You'll meet your local guide at the meeting point a little before 11AM and show your booking. Then we'll commence a fascinating walking tour through the streets, sights, and sounds of Dublin old and new. You'll get an unrivalled insight to the history and culture that has shaped the capital you see today - warts and all, discover the lesser-known, intriguing oddities of our city, and get unique insider tips for the rest of your stay.\nSites and topics covered include:\nDublin Castle, Christchurch, Viking & Medieval Dublin, Temple Bar, fables, folklore and mythology, Trinity College, Stephen's Green, risings and rebellions, writers & rogues and so, so much more... please remember, places are limited and you must book your spot via: https://www.generationtours.com/dublin See you soon!",
    "lat": 53.345177,
    "lon": -6.262646,
    "locationInfo": "3 Crown Alley, Dublin, D",
    "eventName": "Dublin Free Tour - essentials & oddities",
    "eventEndTime": "2024-04-12T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/c/7/600_500855527.webp?w=750"
  },
  {
    "groupName": "Pink K-Pop Dance",
    "eventTime": "2024-04-12T20:00:00+01:00",
    "eventDetails": "Open level K-Pop classes in Dublin by a professional K-Pop dance instructor. I trained in Seoul and have over 10 years of K-Pop experience. 8pm is the Girl Style class, with dances by girl groups like XG, Le Sserafim, New Jeans, Blackpink, STAYC and more. (Song choice is determined with students in classes from week to week) Friday classes are for having fun and enjoying K-Pop, while building your dance skills through stretching, basic steps and step by step teaching of the choreography. Classes are designed to be suitable for beginners, while more advanced students will get extra tips and details throughout the class to keep their skills progressing and add challenge. Choreography is covered over 1 to 2 weeks. We cover the chorus/killing part of each dance.",
    "lat": 53.349827,
    "lon": -6.230249,
    "locationInfo": "117-126 Sheriff Street Upper, Dublin, D",
    "eventName": "K-Pop Dance Class: Girl Style",
    "eventEndTime": "2024-04-12T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/6/4/f/600_515962095.webp?w=750"
  },
  {
    "groupName": "Diversity Ireland",
    "eventTime": "2024-04-12T18:00:00+01:00",
    "eventDetails": "Join us for an empowering and inspiring evening dedicated to celebrating the strength, wisdom, and resilience of incredible women. Exciting Announcement! Join Our Female Leader Meetup organised by Diversity Ireland and The Web3 Passport podcast 🌟\nCalling all aspiring and established female leaders! 📣 Are you ready to ignite your leadership potential and connect with like-minded women? Then mark your calendars for our upcoming Female Leader Meetup!\n🗓 Date: 12th April, 2024\n🕕 Time: 6:30 - 9:00 PM\n📍 Location: BrewDog Outpost, Dublin Docks At this empowering event, we'll be diving into dynamic discussions, sharing insights, and fostering meaningful connections among female leaders from diverse backgrounds and industries. Whether you're a seasoned executive, an emerging entrepreneur, or simply passionate about leadership, this meetup is designed for you. Here's what you can expect:\n✨ If you are an entrepreneur and have a new budding start-up please join us and network.\n✨ Engaging in discussions on navigating challenges and seizing opportunities.\n✨ If you are looking to build your network and currently seeking new opportunities, this is a great event to receive mentoring and guidance.\n✨ Networking sessions to connect with fellow women leaders and expand your professional circle.\n✨ Great event to gain valuable mentoring and guidance and to feel inspired by the stories of the female leaders present in the event.\nThis meetup is not just about sharing ideas; it's about sparking meaningful collaborations, supporting each other's growth, and paving the way for future generations of female leaders.\nDon't miss out on this incredible opportunity to elevate your leadership journey and be part of a community dedicated to empowerment and success. RSVP now to secure your spot!\nLet's lead, inspire, and empower together. See you at the Female Leader Meetup! Please also checkout more information about the event on the eventbrite - https://www.eventbrite.ie/e/elevateher-meet-female-leaders-entrepreneurs-and-riseup-tickets-860519736697?utm-campaign=social&utm-content=attendeeshare&utm-medium=discovery&utm-term=listing&utm-source=cp&aff=ebdsshcopyurl",
    "lat": 53.344856,
    "lon": -6.230761,
    "locationInfo": "4, Dublin 2, D",
    "eventName": "ElevateHer - Meet Female Leaders, Entrepreneurs and  RiseUp",
    "eventEndTime": "2024-04-12T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/d/8/600_520143032.webp?w=750"
  },
  {
    "groupName": "GoodRec Play Football in Dublin Everyday",
    "eventTime": "2024-04-12T17:00:00+01:00",
    "eventDetails": "To play in this game you MUST sign up in the GoodRec App here: https://goodrec.onelink.me/59V5/meetup3 ⚠️If you don’t do this step you will not have a spot reserved⚠️ We organize games every day across the city! Indoor and outdoor, social and competitive. Choose any game you want from Monday - Sunday. Follow our Instagram to see game photos & videos:\n@goodrecsports Any questions, message us on the app or IG !",
    "lat": 53.339531,
    "lon": -6.230142,
    "locationInfo": "South Lotts Road, Dublin 4, D",
    "eventName": "6v6 Outdoor game @ SportsCo⚽Check Description ⬇️",
    "eventEndTime": "2024-04-12T18:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/e/5/600_519591941.webp?w=750"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-12T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt !\nCost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-12T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750"
  }
]