[
  {
    "groupName": "Dublin Girls 18 to 23",
    "eventTime": "2024-04-11T19:00:00+01:00",
    "eventDetails": "Hi girls. The next meetup will be for a Flamenco show in O'Reilly Theatre, Belvedere College, 6 Denmark Street Great, Rotunda, Dublin 1. It is on Thursday 11th April at 7pm. For this show everyone can buy their own ticket from the link below as the seating is on a first-come first-served basis. Please let me know in the whatsapp group or text me here on meetup if you want to go as part of the group so we can meetup together and try to find seats next to each other. Looking forward to seeing you there. Buy Ticket: https://feverup.com/m/158869?utm_source=Instagram_Stories&utm_medium=ad&utm_campaign=158869_dub&ad_id=120206625661660121&fbclid=PAAaY0of6cjToCtAwD2KnFRBZq99XZQv_OvZM5R8as6EoFMGZsXMJ48VErRrw_aem_ARUcrwxdJ1BHErhq_o8w3Lv0zzXWmsaqm24FuLYUM24c9Ws3IexlA2t4Aq09NhID62avNeCRrYsq18jmBtTnL9B1 Join Whatsapp group:\nhttps://chat.whatsapp.com/CJdps4n7JV5KjdikGzn1xa",
    "lat": 53.35555,
    "lon": -6.262158,
    "locationInfo": "Belvedere College, 6 Great Denmark Street, Dublin",
    "eventName": "3rd Meetup - Flamenco Dance Show",
    "eventEndTime": "2024-04-11T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/e/7/c/600_519984188.webp?w=750"
  },
  {
    "groupName": "Le Chéile Running Group",
    "eventTime": "2024-04-11T10:00:00+01:00",
    "eventDetails": "We will start the session with some light stretching exercises to warm us up, and help to prepare us for the run. The pace of the run will be slow, with a couple of stops, along the way, depending on the progress of the group. Sessions will be geared to get you back in shape, one step at a time :)) PLEASE NOTE: That, if you RSVP a particular event, then please ensure that you attend, as there may be other members relying on you for company on the run. IMPORTANT NOTE: Any run or activity that you participate in with the group will be at your own risk.",
    "lat": 53.36583,
    "lon": -6.322956,
    "locationInfo": "Blackhorse Avenue, Phoenix Park, Dublin 7, D",
    "eventName": "Meet up, Warm up, and Get Moving to Get Fit :)",
    "eventEndTime": "2024-04-11T12:00:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Dublin Free Tours",
    "eventTime": "2024-04-11T11:00:00+01:00",
    "eventDetails": "You'll meet your local guide at the meeting point a little before 11AM and show your booking. Then we'll commence a fascinating walking tour through the streets, sights, and sounds of Dublin old and new. You'll get an unrivalled insight to the history and culture that has shaped the capital you see today - warts and all, discover the lesser-known, intriguing oddities of our city, and get unique insider tips for the rest of your stay.\nSites and topics covered include:\nDublin Castle, Christchurch, Viking & Medieval Dublin, Temple Bar, fables, folklore and mythology, Trinity College, Stephen's Green, risings and rebellions, writers & rogues and so, so much more... please remember, places are limited and you must book your spot via: https://www.generationtours.com/dublin See you soon!",
    "lat": 53.345177,
    "lon": -6.262646,
    "locationInfo": "3 Crown Alley, Dublin, D",
    "eventName": "Dublin Free Tour - essentials & oddities",
    "eventEndTime": "2024-04-11T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/c/7/600_500855527.webp?w=750"
  },
  {
    "groupName": "Dublin Buddhist Centre",
    "eventTime": "2024-04-11T07:30:00+01:00",
    "eventDetails": "These events are suitable for those who already have a regular meditation practice and want to continue to do so in a supportive environment with other meditators. There is no requirement to book in advance, just turn up, or log in. For online sits, please click the link below a few minutes before each sit. Join the morning meditations each day using Zoom (password if required is dropinmed ). On a donation basis. No need to book, just drop in if you know how to meditate.",
    "lat": 53.351986,
    "lon": -6.253541,
    "locationInfo": "James Joyce Street, Dublin, D",
    "eventName": "Drop In Morning Meditation (In person and Online)",
    "eventEndTime": "2024-04-11T08:25:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/d/5/5/600_515492085.webp?w=750"
  },
  {
    "groupName": "The Trail Blazers Hiking Group",
    "eventTime": "2024-04-11T09:45:00+01:00",
    "eventDetails": "Thursday morning ramble in the garden of Ireland.\nMeeting at Djouce woods carpark Longhill at 09:45 and ready to rock at 10 am.\nStrong fit hikers only, please.\nAbsolutely no first timers.\nApproximately 22klm with 1000mts gained.\nProper hiking boots,gaiters, and attire.\nIf you have vertigo or a fear of hights then this is not for you.",
    "lat": 53.155567,
    "lon": -6.187775,
    "locationInfo": "Roundwood, Co. Wicklow",
    "eventName": "Special Request: Once again, Tonduffs via O'Tooles Rock",
    "eventEndTime": "2024-04-11T15:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/c/a/3/600_520207331.webp?w=750"
  },
  {
    "groupName": "GoodRec Play Football in Dublin Everyday",
    "eventTime": "2024-04-11T17:00:00+01:00",
    "eventDetails": "To play in this game you MUST sign up in the GoodRec App here: https://goodrec.onelink.me/59V5/meetup3 ⚠️If you don’t do this step you will not have a spot reserved⚠️ We organize games every day across the city! Indoor and outdoor, social and competitive. Choose any game you want from Monday - Sunday. Follow our Instagram to see game photos & videos:\n@goodrecsports Any questions, message us on the app or IG !",
    "lat": 53.339531,
    "lon": -6.230142,
    "locationInfo": "South Lotts Road, Dublin 4, D",
    "eventName": "6v6 Outdoor game @ SportsCo⚽Check Description ⬇️",
    "eventEndTime": "2024-04-11T18:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/e/5/600_519591941.webp?w=750"
  },
  {
    "groupName": "Do you have a Business in Dublin? Join us to Network..",
    "eventTime": "2024-04-11T07:00:00+01:00",
    "eventDetails": "Join our Business Network - for small Businesses in Dublin\nWe meet in person every week - this meetup is to let you all know there are 18 small businesses attending every Thursday morning to network in Dun Laoghaire Co.Dublin. We have a friendly and professional local business networking group with 18 + Local Businesses\nWe meet in person every Thursday Morning 7 am at the Royal St George Yacht Club.\nThe group is comprised of men and women who are looking for people with their own business to network with us to give and get business referrals = more business for you Bring yourself, bring business cards, a positive attitude. Tell us a bit about your Business. Great business environment. Please Contact:\nRhona on 087 7807523 for information and full directions, thank-you.",
    "lat": 53.295635,
    "lon": -6.133322,
    "locationInfo": "Harbour Road, Dún Laoghaire, Co",
    "eventName": "Join our Business Network - for small Businesses in Dublin",
    "eventEndTime": "2024-04-11T08:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/e/1/6/600_513868182.webp?w=750"
  },
  {
    "groupName": "International Professionals -English speaking jobs in Sweden",
    "eventTime": "2024-04-11T16:00:00+02:00",
    "eventDetails": "Get help with applying for your Swedish work visa, meeting employers and applying for jobs. ## About this event ABOUT THIS WORKSHOP:\nOur workshop is specially designed to give international job seekers in Sweden an insight into what is required by Swedish employers and how to improve their chances of success. IMPORTANT!\nAll workshops are held as 1 on 1 sessions via online web meetings over Google Meet online with a recruiter in our Stockholm office or in person at the venue. Typical duration is 1 hour.\nPlease email alina@englishjobs.se to check if they meeting is in person or online. You need to book a meeting time with a recruiter. View all available jobs at https://www.englishjobs.se WORKSHOP CONTENTS:\nThis is your chance to work directly with a recruiter and get help with moving to Sweden, finding a job and settling down. You will learn how to apply for jobs in Sweden and getting your work permit / visa. Learn about applying for jobs:\n1. How to match your skills and experience with Swedish companies hiring\n2. Which industries you should focus on and how to find out about jobs available ?\nHow to find opportunities at companies such as Spotify, Truecaller, Tictail that are rapidly expanding into international markets.\n3. How to connect with employers hiring international talent and who to contact\n4. How to present your skills and competencies.\n5. How to apply at the right time depending on the industry and company.\n6. How to send your CV and follow up\n7. How to get decisions and interview requests.\n8. Your expected salary and salary negotiations Learn about getting your work permit:\n1. How the work permit application process works\n2. How to meet employer and migration board requirements.\n3. How to qualify for fast track work permit application\n4. How to secure your work permit, tax id number (personal number)\n5. What you need to know before you arrive in Sweden - housing, food, expense budgets, bank account, settling in\n6. Your rights as an international job seeker, insurance, trade union rules\n7. How to secure a permanent work residence permit\n8. Common mistakes international job seekers make and how to to avoid application errors How to attend\nBook your meeting time with a recruiter on Eventbrite here: https://www.eventbrite.com/o/english-jobs-sweden-33097853453 All meetings are held as 1 on 1 sessions over Skype or Zoom or in person. Typical duration is 45 mins.\nWelcome\nAlina,\nAssistant recruiter,\nEnglishJobs.se",
    "lat": 53.332886,
    "lon": -6.263774,
    "locationInfo": "Block 4 Harcourt Road, Dublin, D",
    "eventName": "Work in Sweden / Europe - Visa, Jobs, Employers, Interviews, Relocation -DUB",
    "eventEndTime": "2024-04-11T17:00:00+02:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/0/b/9/600_503852953.webp?w=750"
  },
  {
    "groupName": "The UpCylers: fixing donated bikes for those in need",
    "eventTime": "2024-04-11T17:30:00+01:00",
    "eventDetails": "Join us at The Bike Hub, Dun Laoghaire Thursday nights to become a bicycle UpCycler extraordinaire that directly helps their community! The bikes you work on are donated to the community. The skills you build will help you take better care of your bike (and your friends and family’s bikes too!) Who it's for: Anyone who wants to help out their community by creating more cyclists! Also helpful if you like tinkering. No experience needed at all. What to bring: Layered clothing - temperatures vary in our heated but open air workshop.\nComfy Shoes - we'll be on our feet.\nSnacks/water - we have some facilities but it's great to bring your own mugs! How it works:",
    "lat": 53.29351,
    "lon": -6.131197,
    "locationInfo": "Queen's Road, Dublin, D",
    "eventName": "Spring Bicycle Upcycler Nights in Dun Laoghaire - newbies welcome!",
    "eventEndTime": "2024-04-11T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/6/f/d/600_520170461.webp?w=750"
  },
  {
    "groupName": "Dublin Retreats & Spiritual Growth",
    "eventTime": "2024-04-11T12:30:00+02:00",
    "eventDetails": "Looking for ways to give your time charitably over the coming season, volunteers welcome on Thursdays after the 12pm mass for tea, coffee & a meet, for prayer & to discuss how we can help out over the coming period in our Parish. All volunteers welcome!",
    "lat": 53.31794,
    "lon": -6.20898,
    "locationInfo": "230 Merrion Road, Dublin 4, D",
    "eventName": "Volunteers welcome",
    "eventEndTime": "2024-04-11T14:00:00+02:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/c/2/c/600_509055404.webp?w=750"
  },
  {
    "groupName": "20s/30s Writers' Group",
    "eventTime": "2024-04-11T17:15:00+01:00",
    "eventDetails": "We chat for the first hour, then get our heads down and write for the remaining hour. Hopefully you can make some progress on whatever you're working on! The venue can get a tad noisy near the end, so it's a good idea to bring noise-cancelling headphones if you can. No worries if you're late - just arrive whenever you can.",
    "lat": 53.341087,
    "lon": -6.262441,
    "locationInfo": "32 Clarendon Street, Dublin 2, D",
    "eventName": "Chat and Write",
    "eventEndTime": "2024-04-11T19:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/8/1/4/600_515215316.webp?w=750"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-11T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt !\nCost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-11T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750"
  },
  {
    "groupName": "Arts/Crafts + Drink & Draw : Social Art Events",
    "eventTime": "2024-04-11T18:00:00+01:00",
    "eventDetails": "TICKET LINK: HERE\n(*Enter the Promo Code TAYLOR10 to get 10€ tickets.) Paint A Canvas Using Florescent Paint With Music And Prizes. Our team will take each person step by step into creating a masterpiece with no experience necessary. Create a painting under UV Lights and do something very different. WHAT TO EXPECT? Artist (to help you paint)\nThemed Painting\nPrizes\nMusic\nUV Lights\nDO YOU DO PRIVATE EVENTS? Yes, we host private events, brand events, hen parties, and work parties. Contact us on alternativedublincity@gmail.com WHERE IS THE VENUE LOCATED? The new space is located in Pawn Shop on Dame Street. IS THERE ALCOHOL? Yes, the bar has alcohol for sale. There is no BYOB option. IS IT WHEELCHAIR ACCESSIBLE? Unfortunately not, this venue is not wheelchair accessible but we do events in other venues which are. DO YOU DO KIDS EVENTS? Nope, all events are 18+. We are very strict on ID. HOW DO I FIND OUT ABOUT EVENTS? Signup to our weekly newsletter. LOCATION Pawn Shop, 15 Dame St, Dublin 2, D02 KD74",
    "lat": 53.344063,
    "lon": -6.265264,
    "locationInfo": "15 Dame Street, Dublin 2",
    "eventName": "Neon Painting: Taylor Swift (10€ TICKETS)",
    "eventEndTime": "2024-04-11T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/e/f/600_520263823.webp?w=750"
  },
  {
    "groupName": "The Art Of Ballet Group",
    "eventTime": "2024-04-11T18:30:00+01:00",
    "eventDetails": "Beginners ballet class suitable for absolute beginners or those with little ballet experience",
    "lat": 53.331211,
    "lon": -6.262236,
    "locationInfo": "Charlemont Street, Dublin 2, D",
    "eventName": "Beginners ballet class",
    "eventEndTime": "2024-04-11T19:45:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Books of Dublin - Literary walks, talks and events",
    "eventTime": "2024-04-11T18:00:00+01:00",
    "eventDetails": "#### Join us on Thursday 11th April for the launch of Jan Carson’s eagerly anticipated collection of stories, “Quickly, While They Still Have Horses”. Author Olivia Fitzsimmons will officially launch the book from 6pm. Refreshments will be served, books will be for sale, and all are welcome! Event free of cost but booking required here: https://booksupstairs.ie/all-events/launch-jan-carson/",
    "lat": 53.34607,
    "lon": -6.25734,
    "locationInfo": "17 D'OlierStreet, Dublin 2, Dublin",
    "eventName": "LAUNCH: ‘Quickly, While They Still Have Horses’ by JAN CARSON",
    "eventEndTime": "2024-04-11T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/1/7/0/600_519461328.webp?w=750"
  },
  {
    "groupName": "DUBLIN EASY WHEELERS",
    "eventTime": "2024-04-11T18:30:00+01:00",
    "eventDetails": "Join us for a social cycle out to Howth Village.\nTotal distance 25 km. Mostly flat with a climb up to Summit, and more often than not some climb back over the hill on the route home. Both climbs are optional.\nHere is our plan for the evening. 1️⃣. We leave at 6.30 pm from the sails sculpture on Clontarf Road.\n2️⃣. Cycle out to Sutton Cross along the coastal cycle path\n3️⃣. Here we turn right and cycle directly over Howth Hill\n4️⃣ Short stop in the village for a coffee and a chat then back to Dublin. Through the winter and into spring this is a night ride.\n🚨 You must have good front and rear lights on your bike 🚨 🪖PLEASE WEAR A HELMET and bring a tube in case you have a puncture WAIVER & RELEASE:\nWe are a group composed of volunteers. We are not a professional organisation. As such, each of us is responsible for our own safety and well-being during an organised event. The organiser(s) is not in any way responsible for any participant on the trip. However, as a group of friends, we make an effort to look out for one another to the best of our ability.\nBy joining this event, you and your guests agree to and accept the following waiver and liability amendment to the Meetup Terms of Service at [https://www.meetup.com/terms/ ;](https://www.meetup.com/terms/%20;",
    "lat": 53.362656,
    "lon": -6.220764,
    "locationInfo": "Alfie Byrne road/ Clontarf road,, Dublin ",
    "eventName": "🟢 Howth evening social cycle",
    "eventEndTime": "2024-04-11T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/a/1/3/600_496471251.webp?w=750"
  },
  {
    "groupName": "Dublin In4squash LGBTQ+ Meetup Group",
    "eventTime": "2024-04-11T18:30:00+01:00",
    "eventDetails": "This squash session for our In4Squash regular members affiliated with Irish Squash as coach Frank will attend and provide tips and this is supported by Irish Squash. If you haven't played squash before with us, please join us for our beginner’s night on the first Monday of each month. Cost will be €7 per person supplemented by Irish Squash to cover cost of courts / facilities / coach and payment will be needed by Revolut. Revolut Lorcan at 086 176 5577 noting the date of the squash session and comment below the event. Changing and shower facilities available. Please arrive 10 mins early as these are new facilities and we will need to arrange access. Following squash we will toast the new venue in one of the TCD local pubs or the Pav. Exciting times!!",
    "lat": 53.345108,
    "lon": -6.255337,
    "locationInfo": "Printing House Square, Trinity College Dublin,, Dublin",
    "eventName": "In4Squash session: regular attendees with coaching (LGBTQ+)",
    "eventEndTime": "2024-04-11T20:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/e/600_501900238.webp?w=750"
  },
  {
    "groupName": "China Ireland Social & Cultural Group",
    "eventTime": "2024-04-11T18:30:00+01:00",
    "eventDetails": "Join us to practise and improve your Chinese/English with native speakers every Thursday at the River Bar (Burgh Quay, Dublin 2) at 6.30pm. Our system:\n• You sit opposite a native speaker of the language you're learning\n• You speak 5mins English, 5mins Chinese, then change table What we offer:\n• Relaxed easy going event\n• Professional and quality service\n• Great networking opportunities\n• All levels catered for from absolute beginner to fully fluent Admission fee €5. 20% off for student card holders. No pre-registration required, just show up. Come to 5 events and the 6th is free. Over 75,000 people have attended our language exchanges to practise and improve their target language - you can too! Everyone is welcome! For more news and info check:\nWebsite: www.languageexchangeireland.com\nFB: www.facebook.com/languageexchangeireland\nInstagram: www.instagram.com/languageexchangeireland",
    "lat": 53.34685,
    "lon": -6.258447,
    "locationInfo": "1 Burgh Quay, Dublin 2, D",
    "eventName": "Chinese-English Language Exchange @ River Bar",
    "eventEndTime": "2024-04-11T20:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/9/7/9/5/600_520058805.webp?w=750"
  },
  {
    "groupName": "English-Spanish Exchange at Malahide Library",
    "eventTime": "2024-04-11T18:00:00+01:00",
    "eventDetails": "We will meet in the lecture hall at the Malahide library every other week. The idea is to have a conversation in your target language and help your partner/partners with their target language. If you have any specific questions about the meeting, send me a DM and Ill get back to you as soon as I can. Please note that this is an Adults only event. Thanks to Silvia for sharing some resources for learning Spanish: Diarios\nwww.infobae.com (Diario de toda Latinoamérica donde pueden elegir el pais de lectura)\nwww.lanacion.com (Diario de Argentina, muy vanguardista) Clases online\nwww.tusclasesparticulares.com\nwww.preply.com\nwww.classgap.com\nwww.lingoda.com\nwww.superprof.com También puede leer mí artículo de blog sobre ayudas para aprender inglés aquí: https://schwarzfunke.wordpress.com/ Here are some ideas during the meetings just to avoid running out of topics:\n1. Word games - Eg. Write down a Person's Name, Place, Animal, Thing based on the chosen alphabet.\n2. Verdad o Mentira - Game based on \"Would I lie to you\" :) For example : https://www.youtube.com/watch?v=bFf7qdZfHvw\n3. Pictionary - I think there is a board in the lecture hall :) Of-course when playing we use our target language.",
    "lat": 53.450893,
    "lon": -6.152569,
    "locationInfo": "Main Street Malahide, Malahide",
    "eventName": "Spanish/English conversation @ Malahide library ",
    "eventEndTime": "2024-04-11T19:30:00+01:00",
    "eventImage": "The img src does not exist."
  }
]