[
  {
    "groupName": "Improv Comedy Dublin - The Playground",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "The Playground is back with its weekly drop-in improv workshop! Running on Monday evenings, this is a chance to experience improv among like minded people. No experience necessary and all levels are welcome! Each week we will have a different theme with exercises and activities to allow us improve our improv skills. Whether you are interested in developing the skills for your professional or personal life, or you are someone who currently performs or would like to perform on stage, then there is something for everyone. The longer term objective of The Playground is to create a place for people to develop and create projects and shows, providing regular opportunities for those who wish to perform in shows. Facilitated by two very experienced improvisers, Neil Curran and Quinton O'Reilly, join us for some play! We also have guest teachers join us too * Each drop in session lasts 2 hours and starts at 7pm in the Teacher's Club. * Each drop in costs just €12. * You can also sign up for membership which costs just €30 per calendar month and gets you access to all workshops. * No experience necessary and all levels welcome. * Events run on a drop in basis offering flexibility for those who can't commit to doing a course. * Payment can be made on arrival. For more about Neil Curran please visit www.lowerthetone.com Check us out on Instagram here: https://www.instagram.com/improv_playground/",
    "lat": 53.35313,
    "lon": -6.265158,
    "locationInfo": "36 Parnell Square West, Dublin 1, D",
    "eventName": "The Playground: Weekly Improv Drop In Event",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/8/6/8/600_515470344.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/improv-comedy-dublin/events/299816579/?recId=6b85c5a8-2636-4235-bf62-3c0a393e44e5&recSource=ml-popular-events-nearby&searchId=1502e5db-5ac4-420c-bc5c-f2d04fa31481",
    "groupLink": "https://www.meetup.com/improv-comedy-dublin/"
  },
  {
    "groupName": "Sober Events ~ Dublin",
    "eventTime": "2024-04-15T19:30:00+01:00",
    "eventDetails": "Indulge in calming teas and snacks while engaging in lively conversations with other artists. As you mingle, exchange experiences and wisdom, fostering a supportive atmosphere aimed at unleashing boundless creativity. This is an opportunity for you to work on your own art piece as well as being surrounded by like minded artists. While we provide the essentials such as paper and brushes, we encourage you to bring your own art supplies to enhance your creative journey. Embrace the opportunity to personalize your artistic process and delve deeper into your unique expression. Tickets sold HERE to secure your spot or pay at the door Through curated activities and meaningful discussions, you'll delve into the heart of your creative challenges. By sharing insights and strategies with your peers, you'll uncover innovative ways to overcome artistic hurdles. Join us in breaking through the barriers of creative block and nurturing a vibrant community of artists.",
    "lat": 53.346085,
    "lon": -6.262688,
    "locationInfo": "51 Wellington Quay, Temple Bar, Dublin",
    "eventName": "Art Block Unlocked: Break Through Creativity Barriers",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/0/2/b/600_519432331.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/sober-events-dublin/events/300034022/?recId=6b85c5a8-2636-4235-bf62-3c0a393e44e5&recSource=ml-popular-events-nearby&searchId=1502e5db-5ac4-420c-bc5c-f2d04fa31481",
    "groupLink": "https://www.meetup.com/sober-events-dublin/"
  },
  {
    "groupName": "Sult na Sollán - Ceol & Gaeilge",
    "eventTime": "2024-04-15T18:15:00+01:00",
    "eventDetails": "PILATES AS GAEILGE - Teagascóir / Instructor - Ally Doyle Bíonn pilates ar fheabhas do shláinte an choirp agus sláinte an intinne. Fág an strus sa bhaile agus bígí linn don seisiún seo. Mura bhfuil ach cúpla focal Ghaeilge - ná bí buartha - beidh fáilte romhat! SONRAÍ ● Cúrsa 8 sheachtain i Nás na Ríogh ● Gach Luan, 18.15 - 19.15 ● €80.00 an cúrsa ● Uasmhéid de deichniúr sa rang ● Is í Gaeilge teanga an ranga ● Fluent Irish not needed Cuir áit in áirithe | Reserve your place THE ALLYWAY FUNKTIONAL TRAINING Unit 2, Milbrook Industrial Estate, Nás na Ríogh 0857636126 theallywayft@gmail.com",
    "lat": 53.216213,
    "lon": -6.659443,
    "locationInfo": "Millbrook Industrial Estate, Naas",
    "eventName": "Pilates as Gaeilge",
    "eventEndTime": "2024-04-15T19:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/3/4/d/600_470625901.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/sult-na-sollan/events/300032063/?recId=eaf9d329-216f-4098-8294-e0dbcf09cd36&recSource=ml-popular-events-nearby&searchId=c6d0c520-6a64-44fe-806a-475a44adf96c",
    "groupLink": "https://www.meetup.com/sult-na-sollan/"
  },
  {
    "groupName": "Dublin In4squash LGBTQ+ Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "This squash session for our In4Squash regular members. If you haven't played squash before, please join us for our beginner’s night on the first Monday of each month. Cost will be €7 per person supplemented by Irish Squash to cover cost of courts / facilities and payment will be needed by Revolut. Revolut Lorcan at 086 176 5577 noting the date of the squash session and comment below the event. Changing and shower facilities available. Please arrive 10 mins early as these are new facilities and we will need to arrange access. Following squash we will toast the new venue in one of the TCD local pubs or the Pav. Exciting times!!",
    "lat": 53.345108,
    "lon": -6.255296,
    "locationInfo": "Printing House Square, Trinity College Dublin,, Dublin",
    "eventName": "In4Squash session: regular attendees (LGBTQ+)",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/e/600_501900238.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/dublin-in4squash-meetup-group/events/300145145/?recId=eaf9d329-216f-4098-8294-e0dbcf09cd36&recSource=ml-popular-events-nearby&searchId=c6d0c520-6a64-44fe-806a-475a44adf96c",
    "groupLink": "https://www.meetup.com/dublin-in4squash-meetup-group/"
  },
  {
    "groupName": "Philosophy; Self-Inquiry Group",
    "eventTime": "2024-04-14T19:00:00+01:00",
    "eventDetails": "(Graphics are by Don Sebach 1974) We have changed our venue to the Maldron Hotel in Tallaght. Directions are given below. Also the time has changed back to Sunday, still going ahead for 7 pm. Tonight's meeting is on the classic philosophical self-inquiry question of to what degree are you a robot? And by the implication then to what degree can you become free of being a robot? Here are some generic questions inspired by the meeting's topic: Are You a Robot? Are you motivated by desires? Are you manipulated by urges? Is the world you live in merely a paradigm? Is reality for you only thoughts, concepts and feelings? Is fear, love, likes and dislikes only reactions as guides to survival? Are all interactions with others a means to obtaining what you need? Are all actions learned or innate habit patterns? Is “That which you really are” substituted by identities? Do beliefs and understanding substitute for knowing? Are free will and freedom of choice excuses for any of these manipulations? What is the origin of your next thought? How would an awake and conscious individual react to these questions? How would someone mechanically-driven and internally manipulated react to these questions? People don't like to hear that they might be mechanical. Being a robot suggests that we are programmed.",
    "lat": 53.28402,
    "lon": -6.375945,
    "locationInfo": "Whitestown Way, Dublin 24, D",
    "eventName": "Are You a Robot?",
    "eventEndTime": "2024-04-14T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/c/9/600_519686569.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/philosophy-self-inquiry-group/events/299738912/?recId=4a4ab543-8899-4c37-9c09-a2591ef6e95d&recSource=ml-popular-events-nearby&searchId=40dabf0f-c9a6-4d5a-b854-4a32324c2190",
    "groupLink": "https://www.meetup.com/philosophy-self-inquiry-group/"
  },
  {
    "groupName": "Vibrational sound healing and sound bathing Meetup Group",
    "eventTime": "2024-04-14T18:00:00+01:00",
    "eventDetails": "Please read full description. We’ll kick out the evening by introducing ourselves and a introduction to vibrational sound healing followed by a one hour session conducted by isabel a certified soun healer and Reiki practitioner She’ll be directing the power of Chi and the Vibrations and healing frequencies of Himalayan bowls to different areas of your fisical body and energy centers allowing it to restore, balance and ultimate heal. she'll be using other instruments creating a musical and nurturing environment allowing you to feel restored and new after the session. We’ll wrap up the evening with a cup of herbal tea ✨ Please note sound is only recommended from the 2nd trimester of pregnancy onwards, and is unfortunately not advised for anyone with a pacemaker or with epilepsy or similar condition, and may be uncomfortable for those that experience tinnitus. Please get in touch if you have any questions about this, or if you have any other specific health care needs. Please get in touch by texting me or WhatsApp on 0873260081 to confirm your reservation as spaces are very limited",
    "lat": 53.3285,
    "lon": -6.305052,
    "locationInfo": "Crumlin road,, Dublin",
    "eventName": "Special heart chakra sound healing with yogi tea ",
    "eventEndTime": "2024-04-14T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/1/1/600_520263345.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/dublin-energy-healers-sounds-healers-meetup-group/events/300304816/?recId=4a4ab543-8899-4c37-9c09-a2591ef6e95d&recSource=ml-popular-events-nearby&searchId=40dabf0f-c9a6-4d5a-b854-4a32324c2190",
    "groupLink": "https://www.meetup.com/dublin-energy-healers-sounds-healers-meetup-group/"
  },
  {
    "groupName": "Bray Movement School",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "We're offering Free Trial Classes to anyone interested in joining the Bray Movement School. A school gives us the opportunity to come together as a collective with the dual objective of working on the material and working on ourselves. Through the group we give ourselves a chance to change, transform and most notably, provide a space to awaken and become conscious. A movement practice will provide the platform and broad range of material to contend with. In taking part in a movement school like this I’ll aim to teach material that will help you foster a lifelong movement practice that is independent in its own way and truly unique to you as an individual. We come together as a group to share that unique perspective and elevate our own understanding of movement as part of a community. The school will follow a curriculum based approach in exposing students to what I feel are fundamental practices (listed below) that relate to the field of movement. The teachings will be delivered in an organised, modular and process-based approach in order to present these various systems as a coherent body of knowledge. Website: ronanlewins.ie/movement-school-free-trial",
    "lat": 53.20498,
    "lon": -6.102161,
    "locationInfo": "Bray Bowl, Quinsborough Rd, Bray, Wicklow, al",
    "eventName": "Free Trial Class - Bray Movement School",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/f/9/2/600_520193138.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/meetup-group-nuvyerse/events/300313692/?recId=7047013e-13c4-43e7-a62c-23cf0bbdd1ea&recSource=ml-popular-events-nearby&searchId=b70ffba4-7773-49a2-a5f1-a415d67445c5",
    "groupLink": "https://www.meetup.com/meetup-group-nuvyerse/"
  },
  {
    "groupName": "Dreams, Past Lives & Spiritual Experiences- Eckankar Ireland",
    "eventTime": "2024-04-14T11:00:00+01:00",
    "eventDetails": "Looking for some spiritual inspiration and conversation? Come and visit the Eckankar Book and Info Stand in the Blackrock Market, Blackrock, Co.Dublin. We're in the market on the second Sunday of every month from 11am until 5pm. We are happy to chat with you on most spiritual topics. Some of our books and booklets may help you with an issue you may be struggling with at the moment. If you'd like some inspiring wisdom, spin the wheel and receive a spiritual gift or a quote on a range of life's challenges.",
    "lat": 53.301357,
    "lon": -6.177562,
    "locationInfo": "Blackrock Market, Dublin, D",
    "eventName": "Eckankar Book and Info Stand",
    "eventEndTime": "2024-04-14T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/4/1/1/2/600_520156658.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/dreams-past-lives-spiritual-experiences-eckankar-ireland/events/300185336/?recId=4a4ab543-8899-4c37-9c09-a2591ef6e95d&recSource=ml-popular-events-nearby&searchId=40dabf0f-c9a6-4d5a-b854-4a32324c2190",
    "groupLink": "https://www.meetup.com/dreams-past-lives-spiritual-experiences-eckankar-ireland/"
  },
  {
    "groupName": "Tog Hackerspace",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "These are our regular Monday evening electronics nights. Everyone from absolute beginner to experienced is welcome. These evenings are not classes or tutorials, rather a very friendly informal evening. We have a wide range of people who come. Some are absolute beginners who do not even work or study electronics, but are interested to know more. Others have something that they are already working on. We almost always have some first time visitors and we always give them a tour of the space. Come in with your Pi, Arduino, or whatever you have. Bring your laptop. Maybe you want to make something, solder, breadboard or use our electronic gear. Maybe you have some vague ideas and just want to get started. Or maybe you’re just curious……if so, it’s fine to come along and just see what others are doing. If you would like to get even more involved and have the full use of our space, we would be delighted to have you as a full member. Membership brings many benefits. We are located behind Mr Price and the Bright Lights store on Kylemore Road. We have lots of free parking available.",
    "lat": 53.33013,
    "lon": -6.34628,
    "locationInfo": "Kylemore Road, Dublin 12, D",
    "eventName": "Electronics Night",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/7/c/4/600_502102468.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/tog-dublin-hackerspace/events/299007263/?recId=138cb6e3-801a-49ad-9485-92db9bd76b08&recSource=ml-popular-events-nearby&searchId=34b02c99-4e93-4a3e-b6ab-f61e6ca9418d",
    "groupLink": "https://www.meetup.com/tog-dublin-hackerspace/"
  },
  {
    "groupName": "Dance Workshop",
    "eventTime": "2024-04-15T20:00:00+01:00",
    "eventDetails": "Join us for the grand final of Ceol na Cathrach (Music of the City) celebrating Dublin's traditional musicians. This event will bring together in one stage the talented musicians from The Annesley House performances, showcasing their passion for Irish music in both English and Irish. Don't miss The Big Gig in Dublin's heart!",
    "lat": 53.366085,
    "lon": -6.263964,
    "locationInfo": "St. Columba's Church North Strand,, Dublin",
    "eventName": "CRADICIONAL IRISh COCISIC:\nChe BIG GIG",
    "eventEndTime": "2024-04-15T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/9/8/0/600_520330624.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/meetup-group-cstgommv/events/300351164/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/meetup-group-cstgommv/"
  },
  {
    "groupName": "Dublin Zumba & Yoga Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Are you looking to develop or enhance your yoga practice and improve your health and well-being? Then you are going to love our Fuego Flow Yoga classes! They are the perfect mix of balance & flexibility, strength & relaxation. Whether you are new to yoga or have been practicing for years, you will find something to suit your level and interest. Expect a dynamic yoga class, a fusion of Hatha, Vinyasa, and Power yoga, offering an energizing and mindful experience that leaves you feeling invigorated. This class focuses on building strength, increasing flexibility, fostering mind-body connection, and cultivating mindfulness while providing a satisfying challenge for your body. Suitable for all levels Theme of this class: Balance and Bone Health This session emphasizes balance poses that enhance bone health and stability. By improving balance, you reduce the risk of falls and fractures. Additionally, these poses engage weight-bearing bones, which can help prevent conditions like osteoporosis. Join us every Tuesday at 7pm at The Carmelite Community Centre, 56 Aungier St, Dublin 2, D02 T258 Yoga instructor for this session: Hanna Book your class directly on our website fuegoflow.ie We offer a variety of pricing options. You can get a single class, a pack of 5/10 or one of the unlimited plans. We are also currently offering all you can eat Zumba & Yoga taster month for 50% off for €74.5. You can select the \"Unlimited 1 month Zumba and Yoga pass\" HERE. Use the code TASTER-MONTH during checkout to apply the discount. Please BYOM (Bring Your Own Mat) and be sure to arrive 10 min before the class so you have time to get set up. 🧘We can’t wait to see you on the mat 🧘",
    "lat": 53.34013,
    "lon": -6.266017,
    "locationInfo": "56 Aungier Street, Dublin 2, D",
    "eventName": "Yoga Class with Fuego Flow (theme: Balance and Bone Health)",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/2/8/7/600_516593895.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/fuego-flow/events/300032368/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/fuego-flow/"
  },
  {
    "groupName": "Fáilte Swing Dance Group",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Join us as we step back into the raucous swing dancing era of the 1930’s. SCHEDULE: 7pm - 7:50pm Intermediate Swing Dance Class. Admission €10 per person. 7:50pm - 8:40pm Beginner Solo Jazz Class. Admission €10 per person. 8:40pm - 9:30pm Beginner Swing Dance Class. Admission €10 per person. 9:30pm - 10:00pm Social Dance & Jazz Jam. Free Entry. CLASS DETAILS: FREE SOCIAL DANCE & JAZZ JAM DETAILS: WHAT OTHER EVENTS ARE COMING UP: WHAT TO BRING:",
    "lat": 53.336777,
    "lon": -6.26388,
    "locationInfo": "11 Montague Lane, Dublin, D",
    "eventName": "Monday Swing Dance Social & Jazz Jam ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/4/5/600_518546437.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/failte-swing-dance-group/events/300035369/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/failte-swing-dance-group/"
  },
  {
    "groupName": "Stefano Argentine Tango, Dublin Tango School",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Hi Everyone! Hola! Ciao! Every Monday 18.30 class for absolute beginner, 19.30 for advanced and 20.30 for intermediate dancer 21.30 onwards we have social dance / practice. For Beginner or absolute beginner: no partner and no experience needed. Don't be nervous! 🙂 ... Our classes are fun and exciting - and we're very warm and welcoming 😉 • Experienced teachers. • Attentive, personal tuition. IMPORTANT:- TRAINERS and RUBBER SOLES are NOT suitable for Tango CLASS PRICES with online booking at dublintangoschoo.com https://www.dublintangoschool.com/dublin-tango-school-event-page €13 with loyalty card (6 classes for 78euro) €15 1 classes €20 2 classes in the same day €25 3 classes in the same day PRIVATE TUITION ALSO AVAILABLE. Join our FB group Facebook:- https://www.facebook.com/mytangoforyou/ NB:- to be sure you are always notified of upcoming events, festivals or any schedule changes check out our Facebook page:- Dublin Tango School (That's where we attract most of our attendees) If you prefer to receive information by email just mail me at TangoDublinSchool@gmail.com See you Monday!! Stefano",
    "lat": 53.344807,
    "lon": -6.26579,
    "locationInfo": "Sycamore Building, Sycamore Street, Temple Bar, Dublin",
    "eventName": "Tango Lessons for Beginners - Prepare to meet new people & dance!",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/7/0/5/600_486175045.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/stefano-tango-dublin/events/300034014/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/stefano-tango-dublin/"
  },
  {
    "groupName": "Irish Social Dancing: Set Dancing and Sean Nós",
    "eventTime": "2024-04-15T19:15:00+01:00",
    "eventDetails": "Hello all! My name is Louise O Connor. Im a fiddle player and dancer from County Clare and I love teaching the Irish dances I grew up doing back home. You're very welcome to join us for social dancing in the Backroom of The Cobblestone starting again January 15th at 7.15pm. It is very relaxed and informal and always great fun. The dancers that have come so far have all gotten to know each other which is lovely. They have been locals as well as people coming from different countries. Booking link is here: www.louise.ie/beginners Ill be teaching set dancing which is an traditional Irish social dance. You do not need a partner to attend and all levels of dancers are welcome. We will dance a different set each night. If you are already familiar with the sets you can still enjoy dancing through the sets. We will learn the Plain, Ballyvourney Jig, Kilfenora amongst others. You can of course carry on the night in The Cobblestone Pub after where there is always brilliant live music playing. I will also be organising some live music Céilí or party events. The next one will be on January 28th in the Grand Social. All the info is here: www.louise.ie/areyadancin We'll have a live band and Irish College style dances instructed in both English and Irish",
    "lat": 53.349808,
    "lon": -6.277836,
    "locationInfo": "77 King Street North, Dublin, D",
    "eventName": "Beginners Irish Social Dancing in The Cobblestone Pub: Set Dancing ",
    "eventEndTime": "2024-04-15T20:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/6/1/a/600_506426138.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/irish-social-dancing-set-dancing/events/299894526/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/irish-social-dancing-set-dancing/"
  },
  {
    "groupName": "Dublin Dance co-op",
    "eventTime": "2024-04-15T19:45:00+01:00",
    "eventDetails": "www.dublindancecoop.com for more info! Every Monday at 7.45 in the F2 Rialto. 12 euros. All Welcome. Freeform dancing, stretching, rolling around and playing with anything dance related. No experience necessary!",
    "lat": 53.337223,
    "lon": -6.293315,
    "locationInfo": "3 Reuben Plaza, Dublin, D",
    "eventName": "Dublin Dance Co-op",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/dublin-dance-co-op/events/300035267/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/dublin-dance-co-op/"
  },
  {
    "groupName": "Dublin Film Makers ( DFM )",
    "eventTime": "2024-04-15T19:30:00+01:00",
    "eventDetails": "If you're an actor, writer, director, cinematographer or are interested in trying your hand at any area of filmmaking, amateur, professional or complete newbie come along to Dublin Film Makers. We're a group of people from all different backgrounds and with different skills who love to come together, share our knowledge and make films. New members are very welcome!",
    "lat": 53.333214,
    "lon": -6.264256,
    "locationInfo": "Camden Street Lower, Dublin, D",
    "eventName": "Dublin Film Makers Meetup",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/dublin-film-makers/events/300033694/?recId=62fac948-ea3d-43af-aad3-2ef14282bb2f&recSource=ml-popular-events-nearby&searchId=4f66e80a-83b9-41c6-bf11-0addea6abada",
    "groupLink": "https://www.meetup.com/dublin-film-makers/"
  },
  {
    "groupName": "Rathfarnham Sewing Classes",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Details: SPACE: Four participant sewing class, plus the host, held in a comfortable, spacious living room , with double doors beside us, as we work. CLASS CONTENT: Learn to use a sewing machine (maybe bring your own along if you wish to gain confidence in using it) Make a cute cotton tote bag (or your own project) / have some fun / meet like minded new friends and learn a new skill / craft. Progress to make a simple piece of clothing! What’s available: MATERIALS: I supply large selection of threads / pins / needles and rippers! You may wish to bring your own fabric and extras eg. ribbon, lace etc for your individual item (happy to help you choose/source fabrics) Also up-cycling of an old crisp cotton dress or shirt is encouraged.",
    "lat": 53.28154,
    "lon": -6.300384,
    "locationInfo": "33 The Rise, Dublin, D",
    "eventName": "Rathfarnham Sewing Machine Classes MONDAY 7.00  for fun and creativity",
    "eventEndTime": "2024-04-15T20:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/7/2/0/600_499270016.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/rathfarnham-sewing-classes/events/300329901/?recId=62fac948-ea3d-43af-aad3-2ef14282bb2f&recSource=ml-popular-events-nearby&searchId=4f66e80a-83b9-41c6-bf11-0addea6abada",
    "groupLink": "https://www.meetup.com/rathfarnham-sewing-classes/"
  },
  {
    "groupName": "The Plant Based Life",
    "eventTime": "2024-04-14T12:30:00+01:00",
    "eventDetails": "Finally, Please join me for a guided tour to Brú na Bóinne and the Newgrange Chamber Link here please pick the 3 hour tour which has a cost of 18 euros it is the first option. Sunday 14th April at 13:00 Brú na Bóinne Tour + Newgrange Chamber https://brunaboinne.admit-one.eu/ UNESCO site; Brú na Bóinne, located in County Meath. This ancient site is home to the prehistoric monuments of Newgrange, Knowth, and Dowth, all of which were constructed over 5,000 years ago. As such, these structures are older than the pyramids of Giza and Stonehenge, making them an impressive feat of engineering and architecture.",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Brú na Bóinne Tour + Newgrange Chamber - Sunday 14 April 2024 - 1:00pm",
    "eventEndTime": "2024-04-14T17:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/4/9/c/2/600_519858882.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/the-plant-based-critic/events/299896089/?recId=9f141a68-9aa9-4dc4-b0cb-5c026c0ce3bf&recSource=ml-popular-events-nearby&searchId=cab000aa-f06c-4491-a7db-a6eedc890e4c",
    "groupLink": "https://www.meetup.com/the-plant-based-critic/"
  },
  {
    "groupName": "Social Events",
    "eventTime": "2024-04-14T14:00:00+01:00",
    "eventDetails": "If you love cherry blossoms, you won’t want to miss this event at the park. Free, but ticket required. Click here to reserve your spot. Enjoy the stunning scenery of pink and white blooms along the tree-lined paths, and capture the perfect shots for your Instagram feed. You can also sample delicious food from the market stalls, and chat with fellow cherry blossom enthusiasts. Don’t miss this chance to experience the park’s cherry blossom bonanza. 🌸 Here are some friendly notes for you: Don’t forget to register here to secure your spot; otherwise, you won’t be able to attend (limited spots). Please sign up, spread the word, and see you on the day! 🎉",
    "lat": 53.32714,
    "lon": -6.236056,
    "locationInfo": "Herbert Park, Dublin, D",
    "eventName": "Instagram-Worthy Cherry Blossom Bonanza: Food, Photos, and Fun",
    "eventEndTime": "2024-04-14T16:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/6/0/9/600_513054793.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/socialevents/events/299314513/?recId=9f141a68-9aa9-4dc4-b0cb-5c026c0ce3bf&recSource=ml-popular-events-nearby&searchId=cab000aa-f06c-4491-a7db-a6eedc890e4c",
    "groupLink": "https://www.meetup.com/socialevents/"
  },
  {
    "groupName": "Let's Get Social Dublin",
    "eventTime": "2024-04-14T13:30:00+01:00",
    "eventDetails": "Get ready to reach new heights and forge lasting connections at our Indoor Bouldering Adventure this Sunday at 1:30 PM! Whether you're a seasoned climber or brand new to the sport, this event is the perfect opportunity to challenge yourself, have fun, and meet fellow enthusiasts in a supportive and social setting. Located at the wall of Sandyford, our indoor bouldering social event is suitable for climbers of all levels. No climbing experience? No problem! Our friendly group will provide guidance, tips, and encouragement every step of the way. Whether you're learning or honing your skills, you'll find plenty of support and encouragement from your fellow climbers. After our exhilarating climb, we'll gather for some well-deserved refreshments and socializing, where you can swap climbing stories, share tips, and make new friends with fellow adventure-seekers. So lace up your climbing shoes, chalk up your hands, and get ready for an afternoon of adrenaline-pumping fun and friendship at our Indoor Bouldering Adventure this Sunday! Let's climb, connect, and conquer together. See you there! 🧗‍♀️🤝🧗‍♂️",
    "lat": 53.277695,
    "lon": -6.209429,
    "locationInfo": "5 Arkle Road, Dublin, Sa",
    "eventName": " 🧗‍♀️ Climb & Connect: Bouldering Adventure at the wall! 🧗‍♂️",
    "eventEndTime": "2024-04-14T15:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/9/2/3/c/600_519337436.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/lets-get-social-dublin/events/299971843/?recId=9f141a68-9aa9-4dc4-b0cb-5c026c0ce3bf&recSource=ml-popular-events-nearby&searchId=cab000aa-f06c-4491-a7db-a6eedc890e4c",
    "groupLink": "https://www.meetup.com/lets-get-social-dublin/"
  },
  {
    "groupName": "Board Games Ireland",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Small Meetup upstairs in Ryan's Bar. Please be aware that there is a very limited amount of reasonably sized tables. This is a casual meet up for people who want to play boardgames. Lots of people bring plenty of games and rules will always be explained so don't worry if you're new to the hobby and you don't have anything to bring along or think you won't know how to play. Check out the comments below where people will say what games they are bringing and express your interest in joining if interested.",
    "lat": 53.350273,
    "lon": -6.252936,
    "locationInfo": "19 Store Street, Dublin 1",
    "eventName": "Monday Night MeetUp",
    "eventEndTime": "2024-04-15T23:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/1/3/0/600_435844400.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/board-games-ireland/events/300032150/?recId=6896c2d4-8e63-4471-8afe-8b73929816f2&recSource=ml-popular-events-nearby&searchId=897b9dad-e21b-4912-9ebf-c59dbe568e6c",
    "groupLink": "https://www.meetup.com/board-games-ireland/"
  },
  {
    "groupName": "The Clockwork Door's Sober Events in Dublin!",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Indulge in calming teas and snacks while engaging in lively conversations with other artists. As you mingle, exchange experiences and wisdom, fostering a supportive atmosphere aimed at unleashing boundless creativity. This is an opportunity for you to work on your own art piece as well as being surrounded by like minded artists. While we provide the essentials such as paper and brushes, we encourage you to bring your own art supplies to enhance your creative journey. Embrace the opportunity to personalize your artistic process and delve deeper into your unique expression. Tickets sold HERE to secure your spot or pay at the door Through curated activities and meaningful discussions, you'll delve into the heart of your creative challenges. By sharing insights and strategies with your peers, you'll uncover innovative ways to overcome artistic hurdles. Join us in breaking through the barriers of creative block and nurturing a vibrant community of artists.",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Art Block Unlocked: Break Through Creativity Barriers",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/0/7/0/600_519432400.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/clockworkdoorevents/events/300034021/?recId=6896c2d4-8e63-4471-8afe-8b73929816f2&recSource=ml-popular-events-nearby&searchId=897b9dad-e21b-4912-9ebf-c59dbe568e6c",
    "groupLink": "https://www.meetup.com/clockworkdoorevents/"
  },
  {
    "groupName": "Dublin Friendly Hangouts",
    "eventTime": "2024-04-14T14:00:00+01:00",
    "eventDetails": "This time we are gathering on Sunday at 2 pm in Clockwork Door in Temple Bar, This time we are taking advantage of a long day to play longer and more complicated games such as Catan, Carcassonne etc. Join us if you want to dive deep into the board games world! You’re more than welcome to bring your own games. Our event is free but this place doesn't serve any drinks or food but they have a kitchen where you can grab a cup of coffee and snacks. They work on pay-per-minute basis, for one hour 6 euro, but we asked them to not to charge us more than 12eur no matter much longer you stay. See you there 👍",
    "lat": 53.3461,
    "lon": -6.26269,
    "locationInfo": "51 Wellington Quay, Dublin, D",
    "eventName": "Board Games and Fun Sunday ",
    "eventEndTime": "2024-04-14T18:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/0/0/e/600_515200974.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/dublin-friendly-hangouts/events/300336436/?recId=9f141a68-9aa9-4dc4-b0cb-5c026c0ce3bf&recSource=ml-popular-events-nearby&searchId=cab000aa-f06c-4491-a7db-a6eedc890e4c",
    "groupLink": "https://www.meetup.com/dublin-friendly-hangouts/"
  },
  {
    "groupName": "New and Not So New In Dublin",
    "eventTime": "2024-04-14T15:00:00+01:00",
    "eventDetails": "Hi all! We will be meeting in St Patrick's Park beside St Patrick's Cathedral at 3pm. Dave has kindly agreed to do his great tour for €5 (instead of €10). After the tour we will go for drinks in Darkey Kelly's pub on Fishamble Street. Ancient Dublin Tour Dublin Rogues Tour invites you on a tour of Ancient Dublin taking in St Patrick's Cathedral, St Patrick's Park, the Liberties, the Iveagh Trust buildings, Christchurch Cathedral, the first Viking Settlement at Wood Quay, Fishamble Street, The Dubh Linn Gardens and Dublin Castle. The tour will last about 1 hour and 30 minutes starting at St Patrick's Cathedral, note we will not be going into any of the buildings but we will discuss the history of all these great landmarks and buildings.",
    "lat": 53.343956,
    "lon": -6.269945,
    "locationInfo": "19 Fishamble Street, Christchurch Pl, Dublin 8, D",
    "eventName": "Ancient Dublin Rogues Tour / Drinks in Darkey Kelly's  after",
    "eventEndTime": "2024-04-14T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/6/9/e/600_503173982.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/dubliners/events/300013915/?recId=9f141a68-9aa9-4dc4-b0cb-5c026c0ce3bf&recSource=ml-popular-events-nearby&searchId=cab000aa-f06c-4491-a7db-a6eedc890e4c",
    "groupLink": "https://www.meetup.com/dubliners/"
  },
  {
    "groupName": "Dance Workshop",
    "eventTime": "2024-04-15T20:00:00+01:00",
    "eventDetails": "Join us for the grand final of Ceol na Cathrach (Music of the City) celebrating Dublin's traditional musicians. This event will bring together in one stage the talented musicians from The Annesley House performances, showcasing their passion for Irish music in both English and Irish. Don't miss The Big Gig in Dublin's heart!",
    "lat": 53.366085,
    "lon": -6.263964,
    "locationInfo": "St. Columba's Church North Strand,, Dublin",
    "eventName": "CRADICIONAL IRISh COCISIC:\nChe BIG GIG",
    "eventEndTime": "2024-04-15T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/9/8/0/600_520330624.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/meetup-group-cstgommv/events/300351164/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/meetup-group-cstgommv/"
  },
  {
    "groupName": "Stefano Argentine Tango, Dublin Tango School",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Hi Everyone! Hola! Ciao! Every Monday 18.30 class for absolute beginner, 19.30 for advanced and 20.30 for intermediate dancer 21.30 onwards we have social dance / practice. For Beginner or absolute beginner: no partner and no experience needed. Don't be nervous! 🙂 ... Our classes are fun and exciting - and we're very warm and welcoming 😉 • Experienced teachers. • Attentive, personal tuition. IMPORTANT:- TRAINERS and RUBBER SOLES are NOT suitable for Tango CLASS PRICES with online booking at dublintangoschoo.com https://www.dublintangoschool.com/dublin-tango-school-event-page €13 with loyalty card (6 classes for 78euro) €15 1 classes €20 2 classes in the same day €25 3 classes in the same day PRIVATE TUITION ALSO AVAILABLE. Join our FB group Facebook:- https://www.facebook.com/mytangoforyou/ NB:- to be sure you are always notified of upcoming events, festivals or any schedule changes check out our Facebook page:- Dublin Tango School (That's where we attract most of our attendees) If you prefer to receive information by email just mail me at TangoDublinSchool@gmail.com See you Monday!! Stefano",
    "lat": 53.344807,
    "lon": -6.26579,
    "locationInfo": "Sycamore Building, Sycamore Street, Temple Bar, Dublin",
    "eventName": "Tango Lessons for Beginners - Prepare to meet new people & dance!",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/7/0/5/600_486175045.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/stefano-tango-dublin/events/300034014/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/stefano-tango-dublin/"
  },
  {
    "groupName": "Dublin Zumba & Yoga Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Are you looking to develop or enhance your yoga practice and improve your health and well-being? Then you are going to love our Fuego Flow Yoga classes! They are the perfect mix of balance & flexibility, strength & relaxation. Whether you are new to yoga or have been practicing for years, you will find something to suit your level and interest. Expect a dynamic yoga class, a fusion of Hatha, Vinyasa, and Power yoga, offering an energizing and mindful experience that leaves you feeling invigorated. This class focuses on building strength, increasing flexibility, fostering mind-body connection, and cultivating mindfulness while providing a satisfying challenge for your body. Suitable for all levels Theme of this class: Balance and Bone Health This session emphasizes balance poses that enhance bone health and stability. By improving balance, you reduce the risk of falls and fractures. Additionally, these poses engage weight-bearing bones, which can help prevent conditions like osteoporosis. Join us every Tuesday at 7pm at The Carmelite Community Centre, 56 Aungier St, Dublin 2, D02 T258 Yoga instructor for this session: Hanna Book your class directly on our website fuegoflow.ie We offer a variety of pricing options. You can get a single class, a pack of 5/10 or one of the unlimited plans. We are also currently offering all you can eat Zumba & Yoga taster month for 50% off for €74.5. You can select the \"Unlimited 1 month Zumba and Yoga pass\" HERE. Use the code TASTER-MONTH during checkout to apply the discount. Please BYOM (Bring Your Own Mat) and be sure to arrive 10 min before the class so you have time to get set up. 🧘We can’t wait to see you on the mat 🧘",
    "lat": 53.34013,
    "lon": -6.266017,
    "locationInfo": "56 Aungier Street, Dublin 2, D",
    "eventName": "Yoga Class with Fuego Flow (theme: Balance and Bone Health)",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/2/8/7/600_516593895.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/fuego-flow/events/300032368/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/fuego-flow/"
  },
  {
    "groupName": "Dublin Dance co-op",
    "eventTime": "2024-04-15T19:45:00+01:00",
    "eventDetails": "www.dublindancecoop.com for more info! Every Monday at 7.45 in the F2 Rialto. 12 euros. All Welcome. Freeform dancing, stretching, rolling around and playing with anything dance related. No experience necessary!",
    "lat": 53.337223,
    "lon": -6.293315,
    "locationInfo": "3 Reuben Plaza, Dublin, D",
    "eventName": "Dublin Dance Co-op",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublin-dance-co-op/events/300035267/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/dublin-dance-co-op/"
  },
  {
    "groupName": "Irish Social Dancing: Set Dancing and Sean Nós",
    "eventTime": "2024-04-15T19:15:00+01:00",
    "eventDetails": "Hello all! My name is Louise O Connor. Im a fiddle player and dancer from County Clare and I love teaching the Irish dances I grew up doing back home. You're very welcome to join us for social dancing in the Backroom of The Cobblestone starting again January 15th at 7.15pm. It is very relaxed and informal and always great fun. The dancers that have come so far have all gotten to know each other which is lovely. They have been locals as well as people coming from different countries. Booking link is here: www.louise.ie/beginners Ill be teaching set dancing which is an traditional Irish social dance. You do not need a partner to attend and all levels of dancers are welcome. We will dance a different set each night. If you are already familiar with the sets you can still enjoy dancing through the sets. We will learn the Plain, Ballyvourney Jig, Kilfenora amongst others. You can of course carry on the night in The Cobblestone Pub after where there is always brilliant live music playing. I will also be organising some live music Céilí or party events. The next one will be on January 28th in the Grand Social. All the info is here: www.louise.ie/areyadancin We'll have a live band and Irish College style dances instructed in both English and Irish",
    "lat": 53.349808,
    "lon": -6.277836,
    "locationInfo": "77 King Street North, Dublin, D",
    "eventName": "Beginners Irish Social Dancing in The Cobblestone Pub: Set Dancing ",
    "eventEndTime": "2024-04-15T20:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/6/1/a/600_506426138.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/irish-social-dancing-set-dancing/events/299894526/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/irish-social-dancing-set-dancing/"
  },
  {
    "groupName": "Fáilte Swing Dance Group",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Join us as we step back into the raucous swing dancing era of the 1930’s. SCHEDULE: 7pm - 7:50pm Intermediate Swing Dance Class. Admission €10 per person. 7:50pm - 8:40pm Beginner Solo Jazz Class. Admission €10 per person. 8:40pm - 9:30pm Beginner Swing Dance Class. Admission €10 per person. 9:30pm - 10:00pm Social Dance & Jazz Jam. Free Entry. CLASS DETAILS: FREE SOCIAL DANCE & JAZZ JAM DETAILS: WHAT OTHER EVENTS ARE COMING UP: WHAT TO BRING:",
    "lat": 53.336777,
    "lon": -6.26388,
    "locationInfo": "11 Montague Lane, Dublin, D",
    "eventName": "Monday Swing Dance Social & Jazz Jam ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/4/5/600_518546437.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/failte-swing-dance-group/events/300035369/?recId=95f084b2-5960-4362-8e90-217ff02ebcf6&recSource=ml-popular-events-nearby&searchId=0fe5106b-b2c0-4821-bb3e-44f67e586129",
    "groupLink": "https://www.meetup.com/failte-swing-dance-group/"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-15T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt ! Cost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-15T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/events/300305737/?recId=250d00d0-72c5-45d7-95d0-0ad729a06793&recSource=ml-popular-events-nearby&searchId=ccdd26c4-1b66-4be5-9692-188c906b7117",
    "groupLink": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/"
  },
  {
    "groupName": "Dublin Free Tours",
    "eventTime": "2024-04-15T11:00:00+01:00",
    "eventDetails": "You'll meet your local guide at the meeting point a little before 11AM and show your booking. Then we'll commence a fascinating walking tour through the streets, sights, and sounds of Dublin old and new. You'll get an unrivalled insight to the history and culture that has shaped the capital you see today - warts and all, discover the lesser-known, intriguing oddities of our city, and get unique insider tips for the rest of your stay. Sites and topics covered include: Dublin Castle, Christchurch, Viking & Medieval Dublin, Temple Bar, fables, folklore and mythology, Trinity College, Stephen's Green, risings and rebellions, writers & rogues and so, so much more... please remember, places are limited and you must book your spot via: https://www.generationtours.com/dublin See you soon!",
    "lat": 53.345177,
    "lon": -6.262646,
    "locationInfo": "3 Crown Alley, Dublin, D",
    "eventName": "Dublin Free Tour - essentials & oddities",
    "eventEndTime": "2024-04-15T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/c/7/600_500855527.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublin-free-tours/events/300306228/?recId=250d00d0-72c5-45d7-95d0-0ad729a06793&recSource=ml-popular-events-nearby&searchId=ccdd26c4-1b66-4be5-9692-188c906b7117",
    "groupLink": "https://www.meetup.com/dublin-free-tours/"
  }
]