[
  {
    "groupName": "Bee Ultimate",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "Join Bee Ultimate for a fun and energetic Ultimate Frisbee beginners session! Whether you're a seasoned player or new to the sport, this co-ed recreational sports event is perfect for anyone looking to meet new people and enjoy a friendly game of Ultimate Frisbee. Bring your A-game and be prepared to have a blast as we run drills, practice throws, and engage in some friendly competition. Don't miss out on the opportunity to be a part of the Bee Ultimate community and enjoy a day filled with laughter, camaraderie, and plenty of Frisbee action. See you on the field! 🐝 What to Wear:\n- Sport clothes (all-weather sport, so dress appropriately)\n- Ideally football boots, runners if not Location:\nPitches: Training Location\nParking available here: Free On-Street Parking Cost:\n€5 per session, or membership plans available Contact Us:\nAny questions, reach out to us through Instagram: Bee Ultimate Instagram, or WhatsApp: Bee Ultimate WhatsApp",
    "lat": 53.306843,
    "lon": -6.346642,
    "locationInfo": ", Dublin, D",
    "eventName": "Bee Ultimate Beginners Session",
    "eventEndTime": "2024-04-13T11:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/5/8/d/600_520314669.webp?w=750"
  },
  {
    "groupName": "DUBLIN RUNNERS",
    "eventTime": "2024-04-13T09:00:00+01:00",
    "eventDetails": "The event details do not exist.",
    "lat": 53.366119,
    "lon": -6.330974,
    "locationInfo": ", Dublin, D",
    "eventName": "Saturday Phoenix Park 10km + @ various pace ",
    "eventEndTime": "2024-04-13T10:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/3/8/600_497031768.webp?w=750"
  },
  {
    "groupName": "Yoga with Reiki - Karina Rodrigues Connection",
    "eventTime": "2024-04-13T07:30:00+01:00",
    "eventDetails": "✨ What is YONI STEAMING: Yoni is the Sanskrit word for womb or Vulva, also it means that our Yoni (vulva) is sacred. Yoni steaming is an ancient practice that has been used for hundreds of years to assist with many symptoms. Yoni steaming has been referenced in ancient texts and used by midwives for hundreds of years. The Yoni steam process involves sitting over a steaming pot of herb-infused water, generally for about 10-30 minutes per session depending on your body. As the steam rises and the herbs penetrate vaginal tissue, then the vagina and uterus are cleansed and soothed. Benefits Yoni steaming benefits include improving menopausal symptoms, cleansing the uterus, and balancing hormones, which can help to regulate periods and ease unpleasant symptoms of menstruation such as cramps, headaches, and vaginal discomfort. Regulating your menstrual cycle, curing uterine prolapse and heavy bleeding, and increasing fertility in women who have not yet conceived.\nConnect with traumas, abuses, and emotions, and release and heal them. Yoni Steam Herbs The herbs you use for vaginal steaming are important. There are a variety of different yoni steam herbs, and they all have different healing. Some herbs you may already have in your kitchen or garden. In my session, I use my intuition to guide me to choose the herbs that my client needs. Yoni steam ingredients generally involve some combination of the following herbs: Basil (cleansing) Rosemary (anti-bacterial and anti-microbial) Oregano (antiseptic) Calendula (anti-inflammatory) Motherwort (cleansing, pain-relieving) Mugwort (all-purpose) Lavender (anti-microbial) Marigolds (anti-inflammatory) Thyme (anti-bacterial and anti-microbial) Each herb used for steaming has its unique benefits, and the right herbs for your mixture depend on your specific needs and wants. ✨ On my Yoni steam session, I give Reiki while you're steaming, then I'll guide you through breathing so we activate the pranas (energy) on the body, you start to feel more connected with the present moment and your heart, with this connection you may be able to access some trauma or wounds that you passed and still on your body, on this deeper level we can release what doesn't serves you anymore, then you can feel a beautiful blossom with your divine feminine. Additionally, people who suffer from severe period symptoms such as bloating, discomfort, or painful cramps will likely benefit from steaming two or three times in the week leading up to their period. Ultimately, the frequency at which you choose to yoni steam depends on your personal needs, comfort level, and cycle. You can't do it during your period or if you are pregnant. ✨ Yoni steam - Exchange €80 duration 90 minutes to 120 minutes 🌼Book your session on the link\nhttps://app.ubindi.com/schedule ✨I'm based in Rathborne and Temple Bar ✨Learn how your body is communicating with you all the time, you just need to be willing to start this new healing journey!\n✨Be responsible for your BODY, for your LIFE.\n✨Learn to listen to yourself, to respect yourself, to forgive and thus become emotionally stronger and no longer feel pain.\n✨ Come and talk to me, I'm with my heart open to listen to you, let's find the best way to navigate your body's memories, pain, or emotions, walking together to discover the emotional and affective cause, strengthening you're throughout the process of connecting with your true self. ♥️ Love and gratitude ♥️\nKarina Rodrigues Connection\nContact: 089.9692341 https://www.instagram.com/p/Cr-7QvitCpk/?igshid=MzRlODBiNWFlZA==",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "✰𝕀𝕟𝕕𝕚𝕧𝕚𝕕𝕦𝕒𝕝 𝕐𝕠𝕟𝕚 𝕤𝕥𝕖𝕒𝕞, ℂ𝕒𝕔𝕒𝕠, ℝ𝕖𝕚𝕜𝕚 ",
    "eventEndTime": "2024-04-13T09:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/a/1/8/600_518035832.webp?w=750"
  },
  {
    "groupName": "Meditation & Yoga at Anam Ashram",
    "eventTime": "2024-04-13T09:30:00+01:00",
    "eventDetails": "An ashram retreat day is a day to nourish the body, calm the mind and get in touch with your true self. The day comprises of spiritual practices from the Yogic path, a combination of gentle Hatha Yoga and various types of meditation and reflection, under guidance. Everyone is welcome and no experience necessary. The yogic path offers us practical ways of growing in spiritual awareness in a chaotic world, to open oneself to union with the Divine, with people and with the natural world. A day retreat at Anam Ashram aims to help participants in the practice of the asanas (Hatha Yoga), contemplation in action (karma yoga), bhakti yoga (union through devotion) and jnana yoga (union through knowledge e.g. wisdom teachings from the mystics or scriptures). It is a deeply nourishing experience. Everyone is welcome and no experience is necessary. For further details please contact Jane at mellettj@gmail.com Cost? Suggested donation of 50 euros. Bring a packed lunch. Tea/coffee/yoga mats / cushions are provided. Facilitators:\nJane Mellett is a qualified yoga and meditation teacher. She has worked in pastoral ministry for over 12 years and is also a qualified Spiritual Director. Since 2016 Jane has lived at Anam Ashram in Tallaght, Dublin and is interested in the integration of Eastern spiritual practices within Christianity and sharing these practices with others. Saule Cameron is working in Clondalkin as a parish pastoral worker and has been in pastoral ministry for the past decade. She is a qualified yoga teacher, Spiritual Director & Godly Play trainer. Saule lives in Athy with her husband and two grown up daughters.",
    "lat": 53.289085,
    "lon": -6.35547,
    "locationInfo": "69 Bancroft Park, Dublin 24, D",
    "eventName": "Ashram Day Retreat",
    "eventEndTime": "2024-04-13T16:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/6/5/a/600_484374874.webp?w=750"
  },
  {
    "groupName": "Hiking and Mountain Skills",
    "eventTime": "2024-04-13T09:00:00+01:00",
    "eventDetails": "Learn all you need to know to become a competent hiker and navigator with Mountain Adventures 74’s ‘Mountain Skills 1’! Keep your eye out for a follow up course for ‘Mountain Skills 2’. 📅 April 13th & 14th\n📍Glenmalure Wicklow Each course costs €120 and €100 for groups up to 6 people, under 18s and students which includes: - 2 full days course\n- tea breaks with hot drinks and food\n- full course notes\n- maps and compass can be provided (maps and compass for sale too)\n- maps with routes for you to practice\n- a free hiking day practice (as part of a weekend) In addition to this : The indoor course location has a fully equipped kitchen, camping facilities and showers for an additional €10. 👉Book your place at www.mountainadventures74.com or email Emmanuel at aeaccom@gmail.com Mountain Skills 1 and 2, is a nationally accredited course by the Mountain Training Board of Ireland and is delivered in an upland environment. The aim of this course is to help you learn the skills you need to get out hiking; independently, safely, responsibly in the mountains of Ireland, the UK and beyond. You will get a recap on Mountain Skills 1 and you will learn how to navigate with confidence using a map, a compass and proper hiking equipment in any weather conditions during daytime, in poor visibility or at night (MS2). At the end of this course, you will have taken a big step forward in developing your own self-confidence and enjoyment in hiking in the Irish mountain wilderness, the UK and the rest of the world pretty much! Some hiking experience is essential before joining the scheme however, you don’t need to be an expert. Registration with Mountaineering Ireland is essential in order to take part in the mountain skills courses and the registration fee is €28. Visit https://www.mountainadventures74.com/mountain-skills/ for further information about this course and many others that we provide! Or email Emmanuel at: aeaccom@gmail.com",
    "lat": 52.95772,
    "lon": -6.35437,
    "locationInfo": ", Glenmalure, Co",
    "eventName": "Mountain Skills 1 Glenmalure Wicklow  ",
    "eventEndTime": "2024-04-13T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/9/f/d/600_520030749.webp?w=750"
  },
  {
    "groupName": "Pathfinder Dublin Roleplaying Games RPGs Meetup Group",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "We are a group that plays Pathfinder, a tabletop RPG. We are relaunching the games in Dublin and for that we need new players like you. We will explain the rules to you and help you create your dream character. If you want to join the fun, get in one of the games at https://warhorn.net/events/ireland-pfs/schedule/2024/04 What do I need?\nJust a set of dice and something to take notes. Do I need a character to play?\nWe have pregenerated characters of all types that you can use right away. Do I need to know all the rules?\nThe basic rules are not difficult, and we can help you get up to speed if you don't know them. Here is a basic guide https://www.simplypf2e.com/simplyplayers  It's free, just buy something at the shop if you like.",
    "lat": 53.34277,
    "lon": -6.249773,
    "locationInfo": "44 Westland Row, Dublin 2",
    "eventName": "Pathfinder back at Dublin (Centra, 44 Westland Row). Looking for new players!",
    "eventEndTime": "2024-04-13T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/9/2/a/600_520142346.webp?w=750"
  },
  {
    "groupName": "Slow Girl Runs",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "Hi all!\nThis Slow Girls Run will be held in Dun Laoighaire, meeting point will be at Dun Laoighaire pier!😊 We plan to complete a 5k with walking and running intervals! A sea swim (or dip) will be held after the 5k! And afterwards we will grab a coffee and chat in a nearby cafe! Let us know if you can join!",
    "lat": 53.292896,
    "lon": -6.129982,
    "locationInfo": ", Dublin, D",
    "eventName": "Slow Girls Run at Dun Laoighaire (with sea swim!) ",
    "eventEndTime": "2024-04-13T12:00:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Le Chéile Running Group",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "IMPORTANT: If you RSVP a particular event, then ensure that you attend, as their may be other members relying on you for company on the run.",
    "lat": 53.36583,
    "lon": -6.322956,
    "locationInfo": "Blackhorse Avenue, Phoenix Park, Dublin 7, D",
    "eventName": "5k Run, we may increase the distance as the weeks progress.",
    "eventEndTime": "2024-04-13T11:00:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Sip and Stretch",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "WE ARE BACK YOGIS!!!🤸‍♀️ Hello everyone, Are you looking to connect within and with others this year? If so, you have come to the right place! Please join me this weekend for Yoga, Coffee and Chats :) (Beginner Friendly Yoga) Where: Our Lady of Dolours Church Hall, Glasnevin When: Saturday mornings @ 10am You will breathe, move and of course, have some fun :) There is a lovely cafe across the road where we can grab a coffee and have the chats afterwards. Hope to see you on the mat! Instagram @emmamc.yoga Investment - €15 for yoga class (or €50 for a 5 class pass, send me a message if you are interested in this pass)\nRevolut: revolut.me/emmamcyoga or pay cash on arrival Kindly bring your own mat to the studio :) Please note - by signing up and taking part in this practice you are also agreeing to take full responsibility for yourself throughout the yoga class. This class is not suitable for pregnant students. If you are working with injuries please modify as needed, I will offer plenty of suggestions throughout. If you are unsure of anything during the practice please stop, rest and check in with me after.",
    "lat": 53.372753,
    "lon": -6.267851,
    "locationInfo": "Botanic Road, Dublin 9, D",
    "eventName": "Yoga, Coffee and Chats",
    "eventEndTime": "2024-04-13T11:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/f/5/9/600_500112121.webp?w=750"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt !\nCost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-13T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750"
  },
  {
    "groupName": "Board Games Ireland",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "A casual meet up for people who want to play boardgames. Lots of people bring plenty of games and rules will always be explained so don't worry if you're new to the hobby and don't have anything to bring along or think you won't know how to play. Check out the comments below where people will say what games they are bringing and express your interest in joining if interested. Detiails: WHEN: Saturday WHERE: Underworld Gaming, Tallaght (Very close to the LUAS stop) COST: €6 for a seat at a table. This cost covers you for the entire day. Tea, coffee and snacks are available to purchase in the shop and they're okay with outside food being brought in. Board Games Ireland has no affiliation with Underworld Gaming. It's just an opportunity to help support a new business. NOTE: For those driving there is a carpark right underneath the shop that works out at about €3 for the day. Google: Best Car Parks - Belgard Square",
    "lat": 53.286221,
    "lon": -6.375814,
    "locationInfo": "9/10 Belgard Square West, Dublin, D",
    "eventName": "Meet Up at Underworld Gaming",
    "eventEndTime": "2024-04-13T17:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/3/e/5/600_498821957.webp?w=750"
  },
  {
    "groupName": "Dublin Health and Wealth Meetup Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Zinzino Health and Wellness Overview and Partner Training - Dublin\nZinzino Health and Wellness Overview followed by Partner Training\nCome and learn about the products that are leading the way in Preventative Personalised Test validated Nutrition.\nVENUE: Radisson Blu Dublin Airport, Corballis, Dublin\nDATE: Saturday 13th April 2024\nTIME: 11.00am - 12.00 for Business Overview\nGuests: FREE of Charge\nPartners: €25 (includes Partner Training)\nThere will be a break before the Partner Training\n13.00pm until 17.00pm\nZinzino Chief Product Officer Dr. Colin Robertson will be covering about why Zinzino products are the preferred choice for many fitness professionals and Elite Athletes around the world due to their efficacy and test validation.\nTraining on how you can build a solid business alongside these unique products from Ambassador Dave Ives from the UK, Black Crown Kirsten Pearse from Netherlands and Director Sue Booth from the UK.\nBook your Partner tickets and Guest tickets at https://shorturl.at/nzBR3",
    "lat": 53.42632,
    "lon": -6.232335,
    "locationInfo": ", Dublin",
    "eventName": "Zinzino Health and Wellness Overview and Partner Training - Dublin",
    "eventEndTime": "2024-04-13T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/8/1/7/600_520206167.webp?w=750"
  },
  {
    "groupName": "Royal Canal Clean-Up Group",
    "eventTime": "2024-04-13T10:00:00+01:00",
    "eventDetails": "Love your canal Meeting the second Saturday of every month at 5 different starting points. We clean up along the canal's edge, towpath & surrounding areas, from Spencer Dock all the way out to Clonsilla and beyond. We also have a small, but growing group of kayakers, who clean up on the canal itself. It's really satisfying getting that hard-to-reach stuff!\nSo if you're into kayaking please contact Nessa at royalcanalcleanup@gmail.com It's completely up to you how long you clean for, but generally, we work for about 2-3 hours. Various Starting Times: 10am - North Strand, Charleville Mall, 1st Lock Keepers Cottage here 10am - 6th Lock (near Crossguns Bridge) at our container here 10am - Ashtown Canoe Club here 11am - Castleknock Train Station here 2pm - Clonsilla Train Station here All Meetup Locations All the equipment you need will be provided...\nGloves, bags, high viz vests and litter-pickers etc. Depending on the location some of us gather for tea/coffee afterwards in various coffee shops along the route. It's nice to get to re-group and chat further. Hope to see you soon,\nThe Royal Canal Clean-up Team http://photos3.meetupstatic.com/photos/event/b/9/7/c/600_437147484.jpeg",
    "lat": 53.349804,
    "lon": -6.26031,
    "locationInfo": "Royal Canal, Dublin",
    "eventName": "Monthly Royal Canal Clean-up",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/7/1/6/600_496799158.webp?w=750"
  },
  {
    "groupName": "The Trail Blazers Hiking Group",
    "eventTime": "2024-04-13T09:30:00+01:00",
    "eventDetails": "Meeting at car park outside Lacken National school at 9.30am (just outside Blessingtown town). This is approx 23km hike on forest tracks & open hillside. First we take the mass path to Sorrel Hill Cairn, Black Hill, Cleevaun Lough, Mullaghcleevaun East & West tops, Black Hill before we hit the beach on return to the car park. This hike should take approx 6hrs or less. Bring appropriate hiking gear & a packed lunch for this hike. Hiking poles and gaiters will be useful. Coffee afterwards in Blessingtown.",
    "lat": 53.138844,
    "lon": -6.491129,
    "locationInfo": "Lacken National School, Blessington, Co",
    "eventName": "Liam Mc Hike - 23km Lacken to Mullaghcleevaun Lough",
    "eventEndTime": "2024-04-13T15:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/4/7/3/600_520246195.webp?w=750"
  },
  {
    "groupName": "Handstands+Coffee @ The Movement Studio-BOOK VIA OUR LINK!!",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Registration/booking on our system at least 24 hours before class is necessary. We do not take walk ins/your rsvp on meetup is not a booking. BOOK HERE From beginner to winner! We have a special weekly 2 hour class that is more like a weekly workshop. It's a very social class, with amazing coffee, great coaching, and smiles and good work being done. Fancy trying something new? Spending time safely outside your comfort zone? Please visit themovementstudio.ie/handstandsandcoffee to book your spot Registration/booking is necessary. We do not take walk ins.",
    "lat": 53.310116,
    "lon": -6.284555,
    "locationInfo": "3 Terenure Place, Terenure, Dublin",
    "eventName": "Handstands+Coffee-BOOK VIA OUR LINK IN DESCRIPTION ONLY",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/3/b/c/600_469821436.webp?w=750"
  },
  {
    "groupName": "Clontarf Running Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "The event details do not exist.",
    "lat": 53.386349,
    "lon": -6.17466,
    "locationInfo": "Raheny, Dublin",
    "eventName": "Clontarf Running Group - let’s get back in training together",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Limitless Living Coaching",
    "eventTime": "2024-04-13T11:00:00+01:00",
    "eventDetails": "Welcome! Do you ever feel stuck? Do you feel like there’s more to life than what you’re experiencing now? Do you want that passion and energy that you know is available, but can’t seem to find? A few years ago, I knew I was destined for more success, more joy, I just didn’t know how to create it consistently. I was searching for answers. I was searching for tools which could bring more passion, creativity, and excitement into my life. I have learned many things along my journey, but the most vital skill of all is how to manage and direct my emotional states. And that is what you’ll learn at this event. You’ll learn how to take ownership and control of the internal forces that guide your life. I started Limitless-Living Life Coaching because of the excitement and joy what I have learned has given me in my own life. I know I must share it with others. This event is free, it is an opportunity for you to come and learn the skills to take charge of how you feel, and who you are. Come join me for 2 hours of self-discovery, and uncover your emotional mastery. If you’re interested in learning more, check out our website @ https://www.limitless-living.eu",
    "lat": 53.321457,
    "lon": -6.217025,
    "locationInfo": "Merrion Road , Ballsbridge., Dublin",
    "eventName": "Limitless Living Coaching Seminar - Emotional Mastery",
    "eventEndTime": "2024-04-13T13:00:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "The Art Of Ballet Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Beginners ballet class suitable for absolute beginners or those with little ballet experience",
    "lat": 53.344948,
    "lon": -6.264755,
    "locationInfo": "Curved Street, Temple Bar, Dublin 2",
    "eventName": "Beginners ballet class",
    "eventEndTime": "2024-04-13T11:45:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "The Healing Forest - Kilternan Dublin 18",
    "eventTime": "2024-04-13T09:30:00+01:00",
    "eventDetails": "Immerse yourself in a soulful journey through the enchanting forests of Roundwood, Co. Wicklow .& Join us for a transformative experience of personal development, mental health support, and community building in the healing arms of nature. This event is perfect for those looking to make new friends, explore the depths of their chakras, and deepen their connection with their inner selves and the wilderness. Embark on a fulfilling trek through the lush landscapes, as we delve into discussions on eco-conscious living and nature appreciation. Our outdoor adventure will not only ignite your soul connection but also provide opportunities for hiking enthusiasts and backpackers to explore the beauties of the world. This event promises to be a rejuvenating experience that fosters growth, friendship, and a love for the outdoors. Let's ignite our souls and find peace in the heart of nature! https://app.acuityscheduling.com/schedule.php?owner=22900897&appointmentType=52587697",
    "lat": 53.06579,
    "lon": -6.224188,
    "locationInfo": ", Roundwood, Co",
    "eventName": "Roundwood hike, B and B , healing ",
    "eventEndTime": "2024-04-14T10:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/5/5/c/600_519646428.webp?w=750"
  },
  {
    "groupName": "Wicklow Nordic Walking",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Join us for a pleasant excursion on the east side! We will walk under the N11 and take the trails and paths through this old forest. Our goal is the newly refurbished Octagon - last seen behind fencing. We should be able to admire the flooring and form an opinion, now that works are complete.\nExpect some slope, some slop, and plenty of great views. A post hike lunch in the lovely Grove Bar might be on the cards too....! Please note - there is a charge of €10 per hike and I can supply poles to anyone who would like to borrow them.",
    "lat": 53.122166,
    "lon": -6.110001,
    "locationInfo": ", Willow Grove, Co",
    "eventName": "A Saturday morning visit to the Octagon! The east side of Glen of the Downs!",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/8/1/b/600_517311227.webp?w=750"
  }
]