[
  {
    "groupName": "Dublin Korean Culture Meetup Group",
    "eventTime": "2024-04-13T19:00:00+01:00",
    "eventDetails": "SATURDAY MEET UP Let's mingle with anybody and everybody who's simply interested in Korean or Irish culture. This is a group for anyone looking to get out and about, meet new people, socialise and enjoy a night out. It will be for all to have loads of craic. Looking forward to seeing old and new faces. Our aim is to create a friendly, sociable and safe way for people to meet and discuss Korean and Irish culture. If you been made to feel uncomfortable or have seen inappropriate behaviour at a meet up then please contact one of our organisers in confidence. As the Covid is still around please only come if you're feeling well. Photo Credit: Jay Park *** PLEASE RSVP *** It is not necessary to buy food, but if you don't please buy at least one drink as restaurants have had a hard time during the pandemic. *** This meetup is for adults only (18+) except where accompanied by a parent or legal guardian (proof of status e.g. court documents may be requested) *** How to get to the meet up: LUAS - the Drunken Fish is right next to the Mayor Square - NCI Luas stop on the red line DART/Irish Rail - Dublin Connolly is probably the easiest station for most people, but the Docklands station is also close PARKING - the carpark for the National College of Ireland (NCI) is probably the most convenient and only charges 5 euro for the whole evening after 5.30pm Meetup details below: New faces welcome!! Bring your 친구 too. 13th April 2024 (SATURDAY) [Time] 19:00 ~ 22:30 [Place] Drunken Fish Restaurant/Bar, The Excise Building, Mayor Street Lower, IFSC, Dublin 1 [Hosts] Bobbie, Jay and Stephen We have our space/tables booked under the name \"Korean Meetup Group\" so please look for the group when you step into the venue. We normally meet in the glass area on the ground floor at the side of the building- if you can't find us then please ask the bar staff. Please contact us using the below details if you have any questions or trouble finding us. [Organiser contact] Bobbie: Instagram: GoodMoodFoodInsta Stephen: 0863070096 KakaoTalk ID: stenu84 Kyle: KakaoTalk ID: icarushs (Phone No.087 752 9224) Heesun: KakaoTalk ID: heessuny Tim: (Phone No. 085 718 5658) *RSVP ESSENTIAL!!!! PLEASE DO RSVP!!!! *Bring your ID if you're lucky enough to look under 25! ;) *There's no admission fee for our meetup however, you'll be kindly asked to purchase at least 1 drink after your arrival. As you could probably imagine, it's not so easy to book such a big place on a Friday evening in Dublin city centre and your cooperation in this will greatly help us to secure the place for our future gatherings. *Take good care of your own belongings and do not consume more alcohol than you can handle, Meetup organisers nor venue management do not hold any responsibilities on lost items before/during or after the meetup. Hope to see you all there! :) *Dublin Korean Meetup is officially sponsored by LingoSpy Ltd. *더블린 코리안 밋업은 '아일랜드 어학원 최저가 검색 서비스, 링고스파이' ( https://LingoSpy.com ( https://lingospy.com/ ))가 공식 후원합니다.",
    "lat": 53.34918,
    "lon": -6.244149,
    "locationInfo": "THE EXCISE BUILDING, MAYOR STREET LOWER, I.F.S.C., DUBLIN 1, Dublin",
    "eventName": "!!SATURDAY!! Dublin Korean Culture @ Drunken Fish !!SATURDAY!!",
    "eventEndTime": "2024-04-13T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/b/8/4/600_520267044.webp?w=750",
    "eventType": "Cultural"
  },
  {
    "groupName": "Dancing classes",
    "eventTime": "2024-04-13T19:00:00+01:00",
    "eventDetails": "7€ for a party and 2 workshops? Yes, you’ve heard it correctly. 💶For just 7€, you’ll gain access to not one, but two thrilling workshops featuring salsa and bachata, led by an amazing guest teacher all the way from Spain and David. Workshops:\n7:00 PM - 8:00 PM - Bachata Lady Styling Open-Level with Sara Cerrillo\n8:00 PM - 9:00 PM - Bachata Partnerwork Open- Level with David & Sara ⏰The party kicks off at 9:15 pm and lasts until 2 am, with an incredible lineup of music to keep you on your feet.\nAnd don’t forget, there’s a bar available to keep the good times flowing all night long. 👗Dress to impress in your urban best! 📍Located at the Commercial Rowing Club.\nThis is one event you won’t want to miss!",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Latin Dance Party",
    "eventEndTime": "2024-04-14T02:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/9/7/6/600_520346998.webp?w=750",
    "eventType": "Entertainment"
  },
  {
    "groupName": "Board Games Ireland",
    "eventTime": "2024-04-14T13:15:00+01:00",
    "eventDetails": "Our free-of-charge Sunday meet-up at The Black Sheep on Capel Street. Our nights are open to everybody, new comers and experienced grizzled veterans. We try to keep an eye out for people there their first time, to make sure they feel welcomed. We have all been there. We'll have board games there on the night but do feel free to bring your own too. Games are always explained, so don't worry about not knowing the rules of new games. Late comers always welcome :) The meet ups are free of charge but we do ask that people support that bar by buying food and/or drink. The bar is very accommodating to us and it's important that we support them in return. Bringing in outside food or drink is completely unacceptable. I'd suggest commenting below with what games you're going to bring along and people can comment if they want to play. More info and location here: https://galwaybaybrewery.com/blacksheep/",
    "lat": 53.349796,
    "lon": -6.269091,
    "locationInfo": "61 Capel Street, Dublin, D",
    "eventName": "Sunday boardgame meetup",
    "eventEndTime": "2024-04-14T23:59:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/1/3/0/600_435844400.webp?w=750",
    "eventType": "Entertainment"
  },
  {
    "groupName": "Indie RPGs Dublin",
    "eventTime": "2024-04-14T15:00:00+01:00",
    "eventDetails": "Join us every Sunday and tell a story as a group by playing a beginner-friendly roleplaying game. Every week we have 2-3 different games. All materials provided and rules are explained at the start of each game, you just need to bring your imagination. *** Game Start Time: 15:00\n(But feel free to arrive earlier, most Sundays at least one regular player will be there as early as 14:30.) Details for the event (number of groups and games) will be published here or earlier on our Discord server. Feel free to ask the organisers any questions you have (here or on Discord).",
    "lat": 53.337063,
    "lon": -6.265483,
    "locationInfo": "11 Wexford Street, Dublin, D",
    "eventName": "Let's play... Liching Sensation",
    "eventEndTime": "2024-04-14T18:00:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Entertainment"
  },
  {
    "groupName": "Theatre Nights Dublin",
    "eventTime": "2024-04-13T19:30:00+01:00",
    "eventDetails": "Travelling across time and space, taking in New York, California, the North of England, London and beyond, from the 20th century to present day, Children of the Sun is a play about how we survive without the benefit of hindsight and how we try to stay afloat in a world saturated in uncertainty. Celebrating Rough Magic's 40th anniversary, Hilary Fannin’s radical adaptation of Maxim Gorky’s classic 1905 dark comedy reworks the original text and draws it into the here and now. Telling the story of how a small family, their odd rattle-bag of friends and one quixotic stranger distract, entertain and enrage each other over a 24-hour period, while beyond their fragile walls their world is being reshaped by inexorable forces. Please secure your ticket online or at the Abbey Theatre box office (€15 - €29, concessions available). Welcome to add your seat number to the comments so others can secure adjacent seats. Can meet at the upstairs Abbey bar before the performance and at the interval. \"If art has any purpose, it should make us feel better.\"\nChildren of the Sun",
    "lat": 53.3484,
    "lon": -6.257178,
    "locationInfo": "26/27 Abbey Street Lower, Dublin 1, D",
    "eventName": "Children of the Sun (Abbey Theatre)",
    "eventEndTime": "2024-04-13T21:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/9/8/8/600_520022440.webp?w=750",
    "eventType": "Social"
  },
  {
    "groupName": "Events, Drinks and Dancing in Dublin",
    "eventTime": "2024-04-13T20:45:00+01:00",
    "eventDetails": "You are invited to come and enjoy this social event. As usual you will be able to meet friends and soon to be friends in a great bar for drinks and social conversation. Dress to impress - The Baily is premium establishment with a smart and neat dress code. Any thing less means you may be turned away by the door staff. It should be quite easy to find me/the organiser. There may be a second location for those that are dressed well and want to drink, chat and dance for the remainder of the night :) Attendees will be expected to purchase at least 1 drink alcoholic or non-alcoholic. Otherwise the bar management will have there bar full of non paying customers which is not good for their business. The organiser has a IT Management group too. If you know any project managers please forward this link to them - they will thank you for it :)\nLink: https://www.meetup.com/Programme-and-Project-Management-Ireland/",
    "lat": 53.341892,
    "lon": -6.258927,
    "locationInfo": "Duke Street, Dublin 2",
    "eventName": "Saturday Drinks and Dancing",
    "eventEndTime": "2024-04-13T22:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/5/3/8/600_482086392.webp?w=750",
    "eventType": "Social"
  },
  {
    "groupName": "Friends Forever!",
    "eventTime": "2024-04-13T19:30:00+01:00",
    "eventDetails": "Are looking for friends? Do you wanna have fun in Dublin? Do you want to chit chat and relax? ... Here you are, this is where to join on Saturday night. We have not a usual location where to meet, we like to go in all the pubs and clubs in town... So, stay tuned for the location. At the end, we also plan the after meetup location where to enjoy the rest of the night. See you all soon.",
    "lat": 53.334053,
    "lon": -6.262954,
    "locationInfo": "57 Harcourt St, Dublin",
    "eventName": "Chat & night out among friends",
    "eventEndTime": "2024-04-13T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/9/1/8/600_474839672.webp?w=750",
    "eventType": "Social"
  },
  {
    "groupName": "Dancing classes",
    "eventTime": "2024-04-13T19:00:00+01:00",
    "eventDetails": "7€ for a party and 2 workshops? Yes, you’ve heard it correctly. 💶For just 7€, you’ll gain access to not one, but two thrilling workshops featuring salsa and bachata, led by an amazing guest teacher all the way from Spain and David. Workshops:\n7:00 PM - 8:00 PM - Bachata Lady Styling Open-Level with Sara Cerrillo\n8:00 PM - 9:00 PM - Bachata Partnerwork Open- Level with David & Sara ⏰The party kicks off at 9:15 pm and lasts until 2 am, with an incredible lineup of music to keep you on your feet.\nAnd don’t forget, there’s a bar available to keep the good times flowing all night long. 👗Dress to impress in your urban best! 📍Located at the Commercial Rowing Club.\nThis is one event you won’t want to miss!",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Latin Dance Party",
    "eventEndTime": "2024-04-14T02:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/9/7/6/600_520346998.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "DUBLIN RUNNERS",
    "eventTime": "2024-04-14T08:30:00+01:00",
    "eventDetails": "Slow, relaxed running\nfollowed by a ☕️",
    "lat": 53.365826,
    "lon": -6.323996,
    "locationInfo": "Blackhorse Avenue, Dublin 7",
    "eventName": "Phoenix Park - LSR 12k - 20k (ish) \n6:00 - 6:30 Min/Km",
    "eventEndTime": "2024-04-14T10:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/6/7/c/600_505122620.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Wicklow Softball Club : co-ed Adult Softball",
    "eventTime": "2024-04-14T12:30:00+01:00",
    "eventDetails": "The Wicklow Softball Club is an inclusive co-ed recreational team based in Greystones co. Wicklow, Ireland. The club welcomes players of all skill levels, offering a supportive environment for both seasoned veterans and newcomers alike. Playing out of Greystones, he club gather regularly for training sessions and matches. The Club is currently in training and recruitment phase. We comprise of two seperate teams, one begginer/novice and one intermediate/ advanced. Whatever your skill level, we're a welcoming group and would be happy to see you.",
    "lat": 53.121365,
    "lon": -6.065368,
    "locationInfo": ", Greystones",
    "eventName": "Wickow Softball Club Training Session",
    "eventEndTime": "2024-04-14T14:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/f/5/0/600_519992592.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "DUBLIN EASY WHEELERS",
    "eventTime": "2024-04-14T09:30:00+01:00",
    "eventDetails": "Its canal side cycling most of the day today as we try out the newly opened grand canal Sallins greenway Distance 83 Km, flat as a pancake( or a crěpe) Here is our plan for the day. 1️⃣We leave Cafe Nero Grand Canal Dock at 930 am. 2️⃣ Cycle out along grand canal with a short detour off the canal at the 12th lock. 3️⃣ We stop for coffee/refreshments at\n[Swans on the green] in Naas (https://maps.app.goo.gl/9GMYF4RsfjNdAqXn8)\n4️⃣ We then cycle back by a slightly different route, through Ardclough Notes: ● It is every participant's responsibility to ride safely, follow the rules of the road, and come prepared with the proper equipment.\n● Please wear a helmet 🪖 and bring a tube, pump, etc in case you get a puncture.\n● Please cycle single file on narrow busy roads WAIVER & RELEASE: We are a group composed of volunteers. We are not a professional organisation. As such, each of us is responsible for our own safety and well-being during an organised event. The organiser(s) is not in any way responsible for any participant on the trip. However, as a group of friends, we make an effort to look out for one another to the best of our ability. By joining this event, you and your guests agree to and accept the following waiver and liability amendment to the Meetup Terms of Service at https://www.meetup.com/terms/ ;",
    "lat": 53.342667,
    "lon": -6.238936,
    "locationInfo": "3 Grand Canal Quay, Grand Canal Dock, Dublin,, Dublin",
    "eventName": "🟠 Sallins Greenway cycle",
    "eventEndTime": "2024-04-14T15:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/e/b/d/600_520327869.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Blanchardstown 5 aside football game",
    "eventTime": "2024-04-14T11:45:00+01:00",
    "eventDetails": "The game is 1 hr duration from 12pm - 1pm ⚽️\n5 a side football game at Ongar community centre or coolmine sports and leisure centre. (It all depends on how many people we get) Sometimes we have up to 22 players depending on confirmations and availability. When that happenes we play full pitch. The cost is usually around €2 - €3 per person. Minimum of 10 players we play at Coolmine and More than that we play at Ongar.\nPlease bring soccer boots, bottle of water 💦 and arrive on time preferably 11:45am or 11:50am for match preparation and payment for the pitch 🕰️\nIf you cannot make it anymore please let us know in advance. The best being 24 hours notice or 2 hours before the game start. We have a group chat were we send all the regular updates and the list on anyone Interested to play that week. Sometimes we play on Thurday nights from 8-9pm or 9-10pm depending on interest and availability.\n🗣️ Please no fighting, screaming, Sunday league slide tackles or arguing too much. There’s no referee and it’s only a friendly game.The vibe is generally friendly but semi-competitive 🔥\nTo play on sunday **FOLLOW THE LINK BELLOW & FOLLOW OUR INSTAGRAM PAGE.\nhttps://www.instagram.com/blanch5asidefootball?igsh=NnM1aXQyYzZtbjZ5&utm_source=qr\nIf you plan to come and join us please add the Instagram account above and send us a message to add you on the list for that particular week unless if you want to be added on the main group chat for regular updates 📩\nIf we do not have a minimum of 10 players confirmed, we cancel the game and we go again the following week.\n💰All forms of payment accepted but cash and revolut preferred 💰",
    "lat": 53.381073,
    "lon": -6.401683,
    "locationInfo": "Ongar Road, Blanchardstown, Dublin 15",
    "eventName": "Blanchardstown 5 aside Football ",
    "eventEndTime": "2024-04-14T13:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/c/b/b/600_498232411.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Portmarnock Football 6 aside Sundays 11 AM",
    "eventTime": "2024-04-14T11:00:00+01:00",
    "eventDetails": "Social 7-a-side astro turf football in Portmarnock Sports & Leisure Centre. All abilities welcome. Games organised through Whatsapp, so please message me to be added to thread",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Sunday @ 11 AM PSLC",
    "eventEndTime": "2024-04-14T12:00:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Sports"
  },
  {
    "groupName": "Mr.Child Fencing Club Kildare/Laois",
    "eventTime": "2024-04-14T13:30:00+01:00",
    "eventDetails": "Sunday training at St.Mary's Hall Portlaoise",
    "lat": 53.036766,
    "lon": -7.291914,
    "locationInfo": "St.Mary's Hall ,, Portlaoise",
    "eventName": "Sunday Training - Portlaoise ",
    "eventEndTime": "2024-04-14T15:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/b/3/1/600_517771537.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Rampage Jugger Club",
    "eventTime": "2024-04-14T13:00:00+01:00",
    "eventDetails": "Training takes place on Sunday at Sean Moore Park, Rain, hail or sun, you will find us there. These sessions are fun and beginner friendly.\nIf you are new you only have to bring sports clothing and trainers. We provide all the material needed and we will show you how to play the sport. Come run around and have some fun :) As a safety requirement, currently all participants must be fully vaccinated.",
    "lat": 53.335804,
    "lon": -6.213597,
    "locationInfo": "Sandymount Beach, Dublin 4, Dublin",
    "eventName": "Rampage Jugger Training for beginners",
    "eventEndTime": "2024-04-14T15:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/3/b/8/600_475773720.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Friendly Football - Non Contact - Positive Fun",
    "eventTime": "2024-04-14T10:45:00+01:00",
    "eventDetails": "Please PREPAY €8 for this game either by (https://pay.revolut.com/profile/davidandl) or Paypal (kenna.david@gmail.com) √ Places are in high demand so unfortunately, failure to show will result in you being removed from the group. √ As always, you participate in these games at your own risk and an agreement to indemnify the organisers from any injury, loss, claim, or infection.",
    "lat": 53.287964,
    "lon": -6.15591,
    "locationInfo": "Monkstown Avenue, Dublin",
    "eventName": "LARGE PITCH - Sunday Footie - PREPAY €8",
    "eventEndTime": "2024-04-14T12:45:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Sports"
  },
  {
    "groupName": "Soccer 4 fun not for professionals - have a fun with us",
    "eventTime": "2024-04-14T11:30:00+01:00",
    "eventDetails": "If you are looking to play soccer(indoor) every sunday at around 11:30 in Dublin(Santry) JOIN US! Its an Indoor pitch 9 aside(big pitch). Most of us are Brazilian players but we also have Turkish and Russian players. €10 per sunday or you can pay monthly.\nGOALKEEPER PLAY FOR FREE! ------- Confirmation of attendance only after payment --------\nif something happens with the event the money will get back to.\nIf you pay the event and don't show up at day you wont be refunded. Keep it on mind(you can send somebody else to play using your ticket) If you not sure of rules please feel free to contact me! PLAY WITH US AND HAVE A FUN.\nEVERYONE IS WELCOME HERE.",
    "lat": 53.40797,
    "lon": -6.242458,
    "locationInfo": ", Dublin, Co",
    "eventName": "Play soccer at Santry dublin indoor on sunday with us - 9 aside - big pitch",
    "eventEndTime": "2024-04-14T13:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/6/0/0/600_519125632.webp?w=750",
    "eventType": "Sports"
  },
  {
    "groupName": "Sighthound Adventures Ireland",
    "eventTime": "2024-04-14T12:00:00+01:00",
    "eventDetails": "Hi All, this is a on lead walk with dogs of all ages and experience welcome. Many who attend are recently rescued and learning. Walk the lovely grounds and see the flowers and wildlife followed by coffee. There is a Fb page Sighthound Adventures Ireland and #dublinhoundwalks on Instagram. All Welcome.",
    "lat": 53.367355,
    "lon": -6.362333,
    "locationInfo": "Farmleigh, Castleknock, Dublin 15, Ireland, Dublin",
    "eventName": "Fun Hound Social walk All welcome ",
    "eventEndTime": "2024-04-14T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/c/d/c/600_504936060.webp?w=750",
    "eventType": "Social"
  }
]